{"ACMD501": "Introduces the masters program; includes historical development of training in the health professions; current issues, challenges and opportunities in academic medicine and health worldwide.", "ACMD502": "Current approaches to leadership within the context of global academic medicine and health professions education; individual applications, group dynamics, teamwork, and interpersonal skill enhancement.", "ACMD512": "Learning theory, teaching methods, assessment techniques related to acquisition and reinforcement of competencies related to parient care, practice-based learning and improvement and systems-based practice.", "ACMD513": "Acquisition and evaluation of interpersonal and communication skills and professionalism including ethics and cultural competence; within the context of health care disparities and health initiatives.", "ACMD591": "Introduction to design and scholarly review of innovations in health professions education; needs assessment, problem selection, use of research methods to study an innovation.", "ACMD598": "Individual projects designing curricular or other innovations for the home program as an application of Year 1 concepts and as part of the capstone experience. Graded CR/NC.", "ACMD621": "Role of portfolios for teachers and learners; develop a personal capstone portfolio that represents each learners accomplishment of the core competencies of the MACM program.", "ANST505": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory in the clinical setting with observation and supervised clinical residency. Prerequisites: ANST 501 and ANST 502. Open only to Nurse Anesthesia majors.", "ANST507": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory in the clinical setting with observation and supervised clinical residency. Prerequisites: ANST 503, ANST 504 and ANST 505. Open only to Nurse Anesthesia majors.", "ANST508": "Utilization of research, which includes the evaluation of research, problem identification within the practice setting, awareness of practice outcomes and the clinical application of research. Recommended preparation: research course; basic statistics.", "ANST509": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory expanded to geriatric, obstetrical, and pediatric anesthesia; anesthetic management to include medically compromised patients. Prerequisite: ANST 505, ANST 506, ANST 507. Open only to Nurse Anesthesia majors.", "ANST511": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory expanded to neuroanesthesia, cardiac anesthesia, trauma anesthesia, critical care and pain management. Prerequisite: ANST 509. Open only to Nurse Anesthesia majors.", "ANST512": "A capstone course that requires student to demonstrate ability to integrate theory, research, and practice through a mentored research experience with direct relevance to graduate specialization. Open only to Nurse Anesthesia majors.", "ANST513": "Correlation of advanced techniques of anesthesia administration with application of scientific and pharmacologic theory in diverse specialty anesthesia rotations. Prerequisite: ANST 505, ANST 507, ANST 509, ANST 511. Open only to Nurse Anesthesiology majors.", "ANST590": "Research leading to the master's degree in nurse anesthesia. Maximum units which may be applied to the degree to be determined by the department. Open to nurse anesthesia majors only. Graded CR/NC.", "ANST591": "Supervised learning in functional and/or clinical area of focus reflecting current trends and development in the field of nurse anesthesia. Open to nurse anesthesia majors only. Graded CR/NC.", "ANST603": "Lectures and laboratory simulation in anatomy emphasizing structure and function of major organs to include brain, cardiovascular, lungs, liver, kidneys and musculoskeletal systems. Acceptance into the USC Program of Nurse Anesthesia.", "ANST604": "Examining the health care system focusing on policy development, health care costs, quality and patient safety, access to care, disparities, and future trends.", "ANST610": "An investigation of the human cardiovascular, respiratory, renal, hepatic, neurological, and hematological systems and cellular physiology with special emphasis on how these systems relate to anesthesia management.", "ANST611": "Emphasis on the professional components of nurse anesthesia practice including scope of practice, organizational leadership, accountability, ethics and collaborative practice.", "ANST614": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory in the clinical setting with observation and supervised clinical residency.", "ANST615": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory in the clinical setting with observation and supervised clinical residency.", "ANST618": "Correlation of techniques of anesthesia administration with application of scientific and pharmacologic theory expanded to neuroanesthesia, cardiac anesthesia, trauma anesthesia, critical care and pain management.", "ANST620A": "A two semester curriculum promoting synthesis and mastery of topics integral to the art and science of nurse anesthesia planning, management, and delivery.", "ANST621B": "A two semester curriculum promoting synthesis and mastery of topics integral to nurse anesthesia planning, management, and delivery. A continuation of ANST 620.", "ANST694A": "Mentored research on an individualized topic of interest leading to the professional doctorate. The project will culminate in a formal written research paper or presentation.", "ANST694B": "Mentored research on an individualized topic of interest leading to the professional doctorate. The project will culminate in a formal written research paper or presentation.", "ANST694C": "Mentored research on an individualized topic of interest leading to the professional doctorate. The project will culminate in a formal written research paper or presentation.", "BIOC504": "Epidemiology, pathobiology, carcinogenesis, tumor biology and heterogeneity, retroviruses, oncogenes, cell cycle control, genetics of cancer, tumor immunology, treatment strategies.", "BIOC511": "Structure, function and metabolism of nucleic acids, proteins, carbohydrates and lipids and related regulatory mechanism including transcription factor and upstream signaling pathways initiated at the cell membrane.", "BIOC531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "BIOC561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "BIOC575": "Exploration of how appropriate biomarkers can predict response to cancer therapy, tumor recurrence after surgery, rapid detection of tumor response and overall prognosis. Recommended preparation: INTD 571 and a basic understanding of molecular biology.", "BIOC581": "Explores the principles and applications of traditional and state-of-the-art methods in molecular biology and biochemistry with live demonstrations of techniques when feasible.", "BIOC590": "Research leading to the master of science degree. Maximum units which may be applied to the degree will be determined by the department. Graded CR/NC.", "BIOC596": "Part-time or full-time, practical work experience in the students field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty. May not be taken until the student has completed at least one semester of enrollment in the graduate program with a cumulative 3.0 GPA.", "CBG504": "Epidemiology, pathobiology, carcinogenesis, tumor biology and heterogeneity, retroviruses, oncogenes, cell cycle control, genetics of cancer, tumor immunology, treatment strategies.", "CBG790": "Research leading to the doctorate. Maximum units which may be applied to the degree to be determined by the department. Open only to doctoral students. Graded CR/NC.", "CNB502": "In-depth dissection of one or more regions of the human body, supplemented with literature research, and teaching practicum. May also enable the student to pursue a minor research investigation in some anatomical region of choice. Focuses on the following anatomical regions: Axial Skeleton, Upper and Lower Limbs, and Thoracic Cavity.", "CNB504": "An intensive introduction to the human skeleton and the fundamentals of bone and dental biology. Covers a variety of topics including: skeletal development; functional interpretation of bone and bony processes; osteological and dental pathology; human anatomical variation; laboratory analyses and imaging techniques; methods for estimating age, sex, and stature; and comparative osteology.", "CNB511A": "Lectures and laboratory in microscopic anatomy emphasizing embryonic origin of the basic body plan, cells, tissues, and organs; ultrastructural and functional correlations.", "CNB531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "CNB561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "CNB572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "CNB580": "Obtain a deeper understanding of clinical anatomy, develop pedagogical skills in small-group anatomical demonstration, and learn to prepare practical exams.", "DSR620": "Selected topics on sub-fields within stem cell biology and organogenesis. Includes review of contemporary literature and research. Open only to master and doctoral students.", "DSR790": "Research leading to the doctorate. Maximum units which may be applied to the degree to be determined by the department. Open only to doctoral students. Graded CR/NC.", "HP200": "Introduction to strategies for promoting health and wellness. Includes self monitoring of health risk behavior, goal setting, and behavior changes.", "HP230": "Nutrition as it relates to health promotion across the lifespan and disease prevention. Discussion of nutrients, factors affecting food choices, food safety and global nutrition issues.", "HP270": "Introduction to concepts of global health and disease control. Issues of globalization, global governance, emerging diseases, infectious disease treatment, and outbreak challenges.", "HP290": "Individual research apprenticeship in health related fields under supervision of a departmental faculty member. Graded CR/NC. Departmental approval.", "HP300": "Overview and analysis of predictors and consequences of health-related behaviors; theoretical viewpoints and strategies for behavior change. Recommended preparation: HP 200", "HP340": "Intermediate statistics for health behavior studies; topics include descriptive statistics, hypothesis testing, correlation and regression, and use of computer software in data analysis.", "HP350": "Introduction to the design, conduct and evaluation of health behavior research studies; quantitative and qualitative approaches to research and analysis. Recommended preparation: HP 340L", "HP365": "Comparison of national and international differences in health status as influenced by cultural practices and lifestyles within geographic, economic, and political environments. (Duplicates Credit in former HP-400m)", "HP370": "Examines the primary goals and methods of epidemiology, the study of factors that influence health and disease in individuals and populations.", "HP408": "Survey of occupational and environmental health. Introduction to epidemiology, exposure assessment, toxicology, policy development, risk assessment, and effects of urban development on health.", "HP420": "Examines the nature and roots of health disparities among women,men, and different ethnic and age groups; methods for reducing such disparities; strategies for prevention services.", "HP421": "Patterns and prevalence of violence; psychosoical, environmental, and biological influences on violent behavior; youth gangs; drugs and violence; family violence; and prevention and intervention strategies.", "HP422": "Provides a broad examination of issues in HIV/AIDS, including behavioral, social, biological, clinical and ethical dimensions of the pandemic in the U.S. and elsewhere.", "HP430": "Examination of causes and consequences of obesity, with emphasis on health risks of type II diabetes and cardiovascular disease. Recommended preparation: HP 230.", "HP432": "Metabolism of carbohydrates, fats, and protein; introduction to vitamins, minerals and dietary modifications in various pathological conditions. Recommended preparation: HP 230.", "HP441": "Covers phases of worksite health promotion: research, design, implementation and evaluation; concerns regarding escalating medical costs and the role of health promotion in offering substitutes.", "HP442": "Overview of causative factors and demographic distributions of the major chronic diseases in the western world; edpidemiologic concepts and research designs. Recommended preparation: HP 320", "HP450": "Overview of traditional Eastern approaches toward health and disease; relevance to modern health issues, emphasizing a comparison between traditional Chinese and modern Western medicine. Recommended preparation: Fundamentals of Medicine", "HP460": "Survey of the development of healthy and the prevention of health-risk behaviors during adolescence. Prevention and promotion techniques will be explored emphasizing cultural differences.", "HP483": "Overview of the impact aging populations will have on global institutions from a variety of perspectives. Examination of public health policy issues.", "INTD504": "Epidemiology, pathobiology, carcinogenesis, tumor biology and heterogeneity, retroviruses, oncogenes, cell cycle control, genetics of cancer, tumor immunology, treatment strategies.", "INTD522": "Overview of microbes, their life cycles and the host responses they elicit, evade or exploit, including the manipulation and the malfunction of the immune system.", "INTD531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "INTD550": "Normal histology and introduction to basic pathological concepts. Provides a solid and basic understanding of normal structures and how they relate to function.", "INTD561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "INTD572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "INTD596": "Part-time or full-time, practical work experience in the student's field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty. May not be taken until the student has completed at least one semester of enrollment in the graduate program.", "INTD620": "Opportunities for Medical students as preceptors, in research laboratories or in field medical services under guidance of sponsors approved by factulty committees. Graded CR/NC.", "INTD622": "A three-to-nine week block of lectures and laboratories focused on particular body system (e.g. Cardiovascular, Renal, etc.). Open only to Health, Technology and Engineering students.", "INTD790": "Research leading to the doctorate. Maximum units which may be applied to the degree to be determined by the department. Open only to doctoral students. Graded CR/NC.", "MBPH550": "Seminar course in which students make oral and written presentations based on original research, published journal articles, or research proposals.", "MBPH596": "Part-time or full-time, practical work experience in the student's field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty. May not be taken until the student has completed at least one semester of enrollment in the graduate program.", "MEDB790": "Research leading to the doctorate. Maximum units which may be applied to the degree to be determined by the department. Open only to doctoral students. Graded CR/NC.", "MEDS220": "Discussion and exercises in clinically relevant topics (professional behavior, patient privacy, medical ethics, cultural competency, teamwork, etc.) in preparation for experience in the clinical setting.", "MEDS280": "Explores the role of medicine/surgery in society, whose ideas about health and disease have undergone enormous changes from antiquity to the present day.", "MEDS315": "Introduction to human anatomy and physiology in relation to common disease processes, and an examination of how technology has transformed western medicine throughout history.", "MEDS320": "Anatomical structure and function of the major regions of the human body as related to health and disease, using clinical cases, lectures and cadaveric demonstrations.", "MEDS330": "Focused examination of medical bionics with emphasis on solutions that enable the disabled and detailed discussions and evaluations of the social and technological aspects of bionic medical devices.", "MEDS335": "An introduction to transformation of a single cell into a mature organism. Prerequisites: BISC-220L or BISC-221L. Recommended preparation: BISC-320L.", "MEDS340": "Study of the human brain with emphasis on structure-functional relationships, illustrative case studies, current imaging techniques, with illustrative laboratory exercises using specimens and slides. Prerequisites: BISC 220L or BISC 221L; CHEM 103 or CHEM 105a or CHEM 115a. Recommended preparation: MEDS 310.", "MEDS350": "The neurochemistry of psychiatric illness and addiction, introduction to brain and nervous system biochemistry, anatomy and disease states. Covers prescribed medications and drugs of abuse.", "MEDS355": "Overview of the cellular make-up of the human skeleton, the functions of bones, clinical application of this knowledge towards bone-related diseases, and introduction to technological advances in orthopedic surgery.", "MEDS360": "A theoretical basis of laboratory approaches that help the biomedical or physician scientist in understanding the etiology of disease and targeting disease processes.", "MEDS420": "Explores enduring and fascinating topics in Pediatrics through a modern lens, incorporating first hand patient-care experiences in clinics and hospitals, and didactic case-based discussions. Prerequisites: BISC 220L or BISC 221L, and MEDS 220.", "MEDS425": "Emphasizes the team-based approach used by forensic scientists, medical examiners and coroners to investigate the circumstances and determine the cause/manner of death. Prerequisites: BISC 220 or BISC 221 and MEDS 220. Open only to sophomores, juniors, and seniors.", "MEDS440": "Introduction to the spectrum of surgical care, taught by surgeons, with the goal of developing an appreciation of the role that surgery plays in society. Prerequisites: BISC 220 or BISC 221 and CHEM 103 or CHEM 105a or CHEM 115a and MEDS 220. Open only to juniors and seniors.", "MEDS445": "Introduction to the spectrum of clinical and scientific issues surrounding contemporary cancer care; molecular diagnostics, genomic medicine, modern therapeutics and community/patient engagement.", "MEDS455": "Introduction to integrative health care; a holistic approach to medicine combining conventional medical therapies with evidence-informed complementary alternative medicine.", "MEDS460": "Principles of emergency medical services, ranging from pre-hospital care and advanced life-saving, to minor injuries and illnesses. Interactive experience with ER physicians/emergency health care providers. Prerequisites: BISC 220 or BISC 221 and MEDS 220. Recommended preparation: MEDS 260.", "MEDS490": "Individual research and readings. Recommended preparation: MEDS 300 and MEDS 360. Not available for graduate credit.Prerequisite: BISC 220 or BISC 221) and CHEM 103 or CHEM 105a or CHEM115a.", "MEDS500": "Exploration of global health issues facing resource-poor societies; emphasizes contributing factors including behavioral and physiological bases, economic, social, and political context.", "MEDS504": "Continuation of concepts from MEDS 503L: basic medical concepts and biological system functions; examination of core principles of science and medical treatment.", "MEDS510": "Critical issues in international control and treatment of malaria. Exploration of biological and epidemiological fundamentals of human-parasite interaction including dynamics of transmission among populations.", "MEDS514": "Examination of prevalent tropical diseases: epidemiology, clinical manifestations, treatment, impact on economies of tropical countries. Key issues related to these diseases; World Health Organization responses.", "MEDS516": "Practical approach to the development of professional skills for providing culturally sensitive clinical health services to ethnically and linguistically diverse patients.", "MEDS519": "Better understand the key issues impacting global oral health, how better care can help reduce the disease prevalence, and ways to prepare the next generation of global health leaders to address the key issues. Open only to Global Medicine majors.", "MEDS530A": "Fundamentals of physiology, chemistry, anatomy, biochemistry and microbiology, as well as pharmacological issues, mathematical basis of lab instruments or techniques, and computational modeling", "MEDS532": "A conceptual framework for understanding global challenges faced in the management of non-communicable diseases, including heart disease, diabetes, chronic lung disease, and cancer.", "MEDS554": "A two-week course providing students with hands-on experience in the practice of rural medicine as they gain exposure to the various socio-economic factors present in Bocas del Toro, Panama. Recommended preparation: MEDS 500, MEDS 501, MEDS 510, MEDS 511, MEDS 514, MEDS 515. Open only to Global Medicine majors.", "MEDS581": "Survey of the specific roles each member of an interprofessional health team plays in the provision of care, based on their professional training. Application of diverse health professional expertise to case studies in healthcare.", "MEDS597B": "Internship course on the use of new technology based on sensors and wireless communications to the healthcare industry. Continues material from GM-597a. Open only to M.S., Electrical Engineering (Wireless Health Technology) students. Graded CR/NC.", "MICB504": "Epidemiology, pathobiology, carcinogenesis, tumor biology and heterogeneity, retroviruses, oncogenes, cell cycle control, genetics of cancer, tumor immunology, treatment strategies.", "MICB522": "Overview of microbes, their life cycles and the host responses they elicit, evade or exploit, including the manipulation and the malfunction of the immune system.", "MICB531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "MICB561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "MICB570": "Critical discussion of current research topics. Students present published and unpublished research results for discussion and critique. Prerequisite: Current enrollment in Microbiology Ph.D. program.", "MICB572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "MPHY572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "MPHY590": "Research leading to the masters degree. Maximum units which may be applied to the degree to be determined by the department. Open only to master students. Graded CR/NC. (Duplicates credit in former PHBI-590.)", "MPHY596": "Part-time or full-time, practical work experience in the student's field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty. May not be taken until the student has completed at least one semester of enrollment in the graduate program.", "MSS790": "Research leading to the doctorate. Maximum units which may be applied to the degree to be determined by the department. Open only to doctoral students. Graded CR/NC.", "NIIN500": "Overview of elemental neuroanatomy and brain systems with an emphasis on a neuroimaging perspective in the human and mouse. Open only to Neuroimaging and Informatics majors.", "NIIN510": "Survey of anatomical and functional neuroimaging approaches and their use to explore the healthy as well as diseased human brain. Open only to Neuroimaging and Informatics majors.", "NIIN530": "Introduces the various approaches used to image the living brain using MR-based techniques. Covers neuroimaging scanning technologies, pulse sequence design, and sources of image artifact. Recommended preparation: familiarity with Matlab. Open only to Neuroimaging and Informatics majors.", "NIIN597": "Leading researchers in the areas of basic and clinical brain imaging, computational methods, and informatics formally discuss their work for which students provide written critical review and comment.", "PAIN703": "Explore the psychological and social perspectives that influence chronic pain, reinforcing the need to look beyond the initial physical diagnosis.", "PAIN708": "Explores opioid therapeutics including proper use, dosing, side effects and its management, use in special populations, and legal/ethical considerations for prescribers and dispensers.", "PAIN710": "Advanced neurophysiology of pain including immunology and epigenetics, neuropathic pain, inflammation, with a series of lectures and sessions to analyze clinical cases.", "PATH531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "PATH550": "Normal histology and introduction to basic pathological concepts. Provides a solid and basic understanding of normal structures and how they relate to function.", "PATH553": "Includes advanced techniques in cell biology, protein and immunochemistry. A practical approach to acquaint new graduate students with current methodologies and applications used in biomedical research. Duplicates credit in former PATH 552a.", "PATH561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "PATH570A": "Recent advances in the understanding of diseased cells and tissues are reported and discussed using standard seminars, as well as autopsy organ reviews.", "PATH570B": "Recent advances in the understanding of diseased cells and tissues are reported and discussed using standard seminars, as well as autopsy organ reviews.", "PATH570C": "Recent advances in the understanding of diseased cells and tissues are reported and discussed using standard seminars, as well as autopsy organ reviews.", "PATH570D": "Recent advances in the understanding of diseased cells and tissues are reported and discussed using standard seminars, as well as autopsy organ reviews.", "PATH572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "PHBI524": "Study of the nervous system at multiple levels through the analysis of four themes: Motor Control; Emotion, Motivation, and Decision-Making; Memory and Learning; and Vision. Prerequisites: BISC 421. Open only to master and doctoral students. (Duplicates credit in former NEUR 524.)", "PHBI531": "Current perspectives on major research areas in cell biology. Emphasis will be on in-depth examination of cellular structures, regulatory processes, intracellular routing and targeting, and cell/environmental interactions. Cross-listed as BIOC 531, MICB 531, MPTX 531, PATH 531, PHBI 531, PSCI 531", "PHBI550": "Lectures and student presentations on advanced topics in molecular, cellular and systemic physiology. Open to Systems Biology and Disease, Physiology and Biophysics, and Pathobiology students only. Graded CR/NC.", "PHBI561": "Biochemistry and molecular biology of replication, transcription, RNA processing, translation, and regulation of gene expression with emphasis on multicellular eukaryotic organisms and comparisons to prokaryotes.", "PHBI572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "PHBI660": "Examination of the genetics, biochemical mechanisms, and physiological characteristics of diseases caused by inherited mutations in ion channels and ion transport proteins.", "PM500": "Overview of behavioral theory and research in disease prevention and health promotion and in adaptation to chronic disease, including an introduction to measures of outcomes. Prerequisite: Admission to HBR Ph.D. Program or permission of instructor.", "PM501": "Overview and application of behavioral theories to the field of health education and promotion. Examines the determinants of health behavior and strategies for change at the individual, group and community level.", "PM502": "Overview of public health concepts and issues, including population health; ethics; health disparities, determinants, and systems of care; global health; policy; health promotion; environmental health.", "PM506": "Overview of program implementation challenges in global health contexts, including best practices for establishing effective cross-cultural collaborations, working with key leaders, and operationalizing complex interventions.", "PM507": "A practical examination of methods and data sources used to evaluate public health services and conduct policy research and evaluation within health care delivery systems.", "PM508": "Historical development of the American health care system; determinants of health care utilization; role of health care providers; health policy; public health services; and health care finance.", "PM509": "Macro-level analysis of the structure and delivery of health care services around the world, including an examination and comparison of health system performance.", "PM510": "Concepts of biostatistics; appropriate uses and common misuses of health statistics; practice in the application of statistical procedures; introduction to statistical software including EXCEL, SPSS, nQuery. Laboratory.", "PM511A": "Major parametric and non-parametric statistical tools used in biomedical research, computer packages including SAS. Includes laboratory. Lecture, 2 hours; laboratory, 2 hours.", "PM511B": "Statistical methods for analysis of categorical data including dichotomous, ordinal, multinomial and count data, using Stata package. Includes laboratory.", "PM511C": "Methods and applications for modeling longitudinal, time-to-event and multi- level data. Includes laboratory using R package. Lecture 2 hrs; laboratory 2 hrs. Prerequisites: PM-511b.", "PM512": "Terminology/uses of epidemiology and demography; sources/uses of population data; types of epidemiologic studies; risk assessment; common sources of bias in population studies; principles of screening. Recommended preparation: algebra", "PM517A": "Study design, ascertainment of study objects, questionnaire development, various methodological issues in study design and interpretation including bias, measurement error, confounding and effect modification.", "PM522A": "a: Density distribution and hazard functions; normal, chi-square, student's t and F distributions; and sampling procedures for single factor and multiple factor designs, distributions. Recommended preparation: working knowledge of multivariable calculus and familiarity with linear algebra.", "PM525": "International variations in health status with a focus on the impact of socioeconomic status, politics, environment, education and gender in etiology of illness, access to health care, progression of disease, and recovery.", "PM529": "An overview of environmental health, identifying issues in assessing effects of exposure on health and potential interventions for reducing adverse health risks. Prerequisite: PM-512", "PM533": "Genetic principles; design and analysis of family studies; introduction to likelihood estimation; segregation and linkage analysis; biomarkers of exposure, susceptibility, and disease; laboratory methods; susceptibility genes; association and linkage disequilibrium.", "PM536": "Overview of concepts, tools, data collection, analysis methods and designs used to evaluate health promotion programs. Examples from substance abuse prevention, family planning and reproductive health programs.", "PM537": "Overview of causative factors and demographic distribution of major chronic diseases in the western world. Epidemiologic concepts, methods and research design as applied to chronic disease prevention will be emphasized. Prerequisite: PM 512.", "PM544": "Exploratory and inferential techniques for multivariate data, Hotelling's T2, multivariate analysis of variance, classification analysis, principle components, cluster analysis, factor analysis. Involves computer use.", "PM552": "Stochastic failure process; parametric models for survival data; sample size estimation procedures for clinical trials; multivariate regression models for binary outcome and censored survival data; computer programs; multiple failure modes and competing risks.", "PM555": "Examination of environmental public health policies/regulations, the role of science in assessment and policy initiatives, barriers to change, and competing interests that influence policy adoption. Recommended preparation: PM-529.", "PM558": "Examine epidemiologic methods, concepts, and statistical approaches; case-study seminars with structured critiques of current literature on human-environment interactions affecting public health. Recommended preparation: PM-510 and PM-512.", "PM559": "Explores the fundamental concepts of cancer epidemiology, including the molecular basis, descriptive epidemiology, and historical and groundbreaking studies that have impacted the field.", "PM563": "Survey of effective community organizing and mobilization efforts in the U.S. and abroad, using participatory, organizational, community empowerment and public-private partnership models.", "PM564": "Introduction to leadership and management concepts, tools, and practices in the context of domestic and global public health and healthcare delivery settings.", "PM565": "Current public health issues and research topics relating to 21st century challenges and threats. Lessons learned and best practices to strengthen public health systems and enhance public health readiness and preparedness.", "PM567": "Definition and chronology of natural and man-made disasters and their effects on the global community. Structure and organization of disaster management systems and the role of humanitarian organizations.", "PM568": "Ethical principles in the distribution of health resources, conduct of global public health research, and implementation of public health initiatives across different nations, cultures, religions.", "PM569": "An introduction to statistical methods for analyzing and interpreting spatially referenced data topics include: geostatistics, areal data, point pattern data and visualization.", "PM572": "Mammalian organ systems operation during health, and pathophysiologic analysis of related diseases with focus on muscle, respiratory, cardiovascular and renal systems. Faculty from basic and clinical sciences.", "PM575": "Study designs, exposure time response, longitudinal, spatial, ecologic correlation and mechanistic models, measurement error interactions, measurement error, public policy implications.", "PM580": "Overview of issues related to infant, child, and adolescent health, including special health considerations at different points in the developmental cycle, health care systems and policies, and health disparities.", "PM585": "History of child health and social welfare programs during the past century. Issues examining health status and health service delivery, the role of health care financing, and health policy.", "PM588": "Provides students with hands on experience of the common methods used in conducting epidemiological studies, and designing and obtaining funding for research projects. Prerequisite: PM-512. Recommended preparation: PM 527.", "PM595": "Part-time or full-time, practical work experience in the students field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty.", "PM596": "Applied practical experience through field placement in federal, state, and/or local public health agencies/organizations, including community-based organizations; research and school-based settings.", "PM605": "Theoretical basis and practical approaches for identifying, summarizing and interpreting current bodies of scholarly information addressing a defined research question.", "PM610": "Special topics of current interest to provide background for research in biostatistics and epidemiology. Based largely on student dissertation research. Graded CR/NC.", "PM612A": "First of three courses in CTR, a discipline that fosters multidirectional integration of basic, patient-oriented and population-based research with long-term goal of improving public health. Recommended preparation: PM 510.", "PM615": "Process of applying for research grants in health behavior research, including dissertation grants. Covers the structure of NIH and other grantmaking agencies, the grant review process, tailoring ideas to the grantmaker's priorities, research design, development of training and mentoring plans, and budgeting.", "PM756": "Short seminar presentations and discussions on issues accompanying the development of the field of health behavior and implementation of research in this field. Graded CR/NC.", "PCPA503": "Current concepts of behavioral medicine as applied to providing health care to diverse populations and investigations of medical care organization and the physician assistant. Open to Physician Assistant Practice majors only.", "PCPA509": "In a seminar format, information management and research methods are explored as well as ethical issues of PA practice will be discussed. Open to Physician Assistant Practice majors only.", "PCPA523": "Laboratory experiences with basic clinical skills essential to medical practice. First of four courses. Open to Physician Assistant Practice majors only.", "PCPA529": "Laboratory experiences with basic clinical skills essential to medical practice. Third of four courses. Open to Physician Assistant Practice majors only.", "PCPA530": "A one semester overview of clinical anatomy, physiology, pathophysiology, and pathology essential to understanding disease mechanisms commonly encountered in primary care and specialty practices of medicine. Open to physician assistant practice majors only.", "PCPA543": "Basic instruction in normal/abnormal states of organ systems in the study of disease. The first of three courses that includes instruction in pathophysiology, pharmacology, diagnostic studies, and medicine. Open to Physician Assistant Practice majors only.", "PCPA549": "Basic instruction in normal/abnormal states of organ systems in the study of human disease. The third of three courses that includes instruction in pathophysiology, pharmacology, diagnostic studies, and medicine. Open to Physician Assistant Practice majors only.", "PCPA563": "One discrete consecutive six-week long, five-day-a-week intensive field placement under a program approved supervising preceptor in a program-approved clinical setting. Requires departmental approval. Graded CR/NC.", "PCPA566": "One discrete consecutive six-week long, five-day-a-week intensive field placement under a program approved supervising preceptor in a program-appoved clinical setting. Requires departmental approval. Graded CR/NC.", "PCPA567": "One discrete consecutive six-week long, five-day-a-week intensive field placement under a program approved supervising preceptor in a program-approved clinical setting. Requires departmental approval. Graded CR/NC.", "PCPA568": "One discrete consecutive six-week long, five-day-a-week intensive field placement under a program approved supervising preceptor in a program-approved clinical setting. Requires departmental approval. Graded CR/NC.", "SCRM511": "Survey of anatomical, cellular and molecular processes that underlie human development and congenital malformations, with discussion of other species for comparison. Open only to Stem Cell Biology and Regenerative Medicine majors.", "SCRM513": "A comprehensive investigation of embryonic, fetal and adult stem cells and the application of stem cell biology to treat disease. Open only to Stem Cell Biology and Regenerative Medicine majors.", "SCRM580": "Reading and discussion of recent papers by the SCRM speaker of the week, and attendance at the speaker's seminar. Open only to Stem Cell Biology and Regenerative Medicine majors.", "SCRM590": "Independent research conducted under the guidance of faculty in the Department of Stem Cell Biology and Regenerative Medicine. Prerequisites: SCRM 511, SCRM 513, SCRM 515, SCRM 522, SCRM 524, SCRM 555, SCRM 580. Open only to Stem Cell Biology and Regenerative Medicine majors. Graded CR/NC.", "SCRM620": "Selected topics on sub-fields within stem cell biology and organogenesis. Includes review of contemporary literature and research. Open only to master and doctoral students.", "TRGN510": "Translational biomedical informatics analysis of next-generation sequencing genomic data, fundamentals, foundations, and concepts for applied analysis, human ontology, application molecular tools, basic computing.", "TRGN514": "Translational next generation sequencing genomics microarrays, RNA-seq, exome sequencing, annotation, transcriptome, ontology, pipelines, variants, expression, methylation.", "TRGN524": "Molecular biotechnology, genomics, next-generation sequencing, epigenomics, drug discovery, biomarkers, microrarrays, commercialization, microarray analysis, expression, proteomics.", "TRGN526": "Covers basic understandings of clinical bioinformatics methodologies and practices, along with the genomic technologies used for clinical diagnostic purposes.", "TRGN536": "Examination of classical and novel techniques used to explore and manipulate gene function and implications for the use of biotechnology in areas of global need. Recommended preparation: two semesters of introductory biology; two semesters of molecular biology and genetics.", "TRGN543": "Global biotechnology industry, idea generation, business plan formulation, intellectual property protection, funding, personnel management including board composition, regulatory body interaction, company exits.", "TRGN546": "Core concepts in intellectual property law, regulatory law, healthcare law, corporate law, and M&A law to the biopharmaceutical and diagnostic device sectors. Open to students who are pursuing or have already attained graduate degrees (MS, PhD or PharmD) in the bioscience disciplines, or students from professional schools who have college-level bioscience background.", "TRGN550": "Written communication modalities for accurate and effective transmission of scientific information to a wide audience in biomedical, healthcare, and related industries.", "TRGN551": "Verbal communication modalities for accurate and effective transmission of scientific information to a wide audience in biomedical, healthcare, and related industries.", "AME101": "Gateway to the bachelor of science degree in mechanical engineering. Introduction to mechanical engineering disciplines and practice; graphical communication and layout of machine parts; introduction to computer-aided drafting and drawing.", "AME105": "Gateway to the Aerospace Engineering major. Introduction to flight vehicle performance and propulsion. Elements of the physics of gases. Laboratory: computers and graphics; model rocket and glider test flights.", "AME201": "Analysis of forces acting on particles and rigid bodies in static equilibrium; equivalent systems of forces; friction; centroids and moments of inertia; introduction to energy methods.", "AME204": "Stress, strain and deflection of mechanical elements due to tension, shear, bending, or torsion; combined loads; energy methods, statically indeterminate structures; strength-based design.", "AME301": "2-D and 3-D kinematics and dynamics of particles and rigid bodies; systems of particles and rigid bodies; coupled rigid bodies; introduction to vibrations.", "AME302": "Modeling of lumped parameter elements and systems; free and forced response of first and second order systems; design oriented approach to dynamic systems.", "AME305": "Design and analysis of mechanical elements including shafts, bearings, springs, screws, belts, and gears; strength, fatigue, and deflection considerations in machine design.", "AME308": "Introduction to the finite element method; practical application of computer analysis tools for structural analysis and design. Prerequisite: AME 204. Corequisite: AME 301.", "AME309": "Fluid statics; conservation of mass, momentum, and energy in integral and differential form; applications. Laminar and turbulent pipe flow; compressible flow; potential flow over bodies.", "AME331": "General principles underlying heat transfer by conduction, convection, and radiation; steady and transient conditions; heat exchangers. Prerequisite: AME-310. Co-requisite: AME-309 or CE-309.", "AME341A": "A coordinated laboratory and lecture sequence on aeromechanical instrumentation and device control stressing the symbiotic integration of mechanical, optical and electronic components.", "AME404": "Mathematical aspects of the solutions to typical advanced mechanical engineering problems. Modeling, simulation, computational aspects, computer solutions, and computational tools. Recommended preparation: FORTRAN, MATLAB, and Maple", "AME408": "Design of mechanical systems using advanced graphics techniques; computer-aided drafting, design optimization, elements of computer graphics, solids modeling; introduction to computer-aided manufacturing. Prerequisite: AME 204 or CE 225. Recommended preparation: AME 308.", "AME410": "Product planning and task clarification, voice of customers, quality function deployment, conceptual and embodiment design, axiomatic theory of design, product quality and manufacturability, design decision-making. Junior standing. Recommended preparation: AME 305", "AME415": "Physics of turbine operation; design and analysis for the development of turbine hardware for propulsion and power generation. Recommended preparation: Familiarity with Matlab.", "AME430": "Design methodology for thermal systems; boilers, condensers, air conditioning, power generation, air pollution control, combustion and alternative fuels. Prerequisite: AME-331; Recommended preparation: AME-312.", "AME451": "Transform methods, block diagrams; transfer functions; stability; root-locus and frequency domain analysis and design; state space and multiloop systems. Prerequisites: AME 302 and MATH-245. (Duplicates credit in EE-482)", "AME457": "Laminar and turbulent boundary layer flow with and without heat transfer; boundary layer separation, stability, transition and control; introduction to compressible fluid flow.", "AME461": "Measurement theory and petroleum/geothermal applications of electrical, radioactive, acoustic, and production logging tools. Estimation of rock porosity, water saturation, permeability, shale content, gas flow rate.", "AME463": "Fundamentals of flow and transport in porous materials including: Properties of porous rocks, capillarity effect, single- and multiphase flow, diffusion and dispersion in miscible displacements.", "AME465": "Theory and practice in drilling technology; mechanical properties of reservoir rocks; well completion; acidizing and fracturing, oilproduction gechnology. Lecture, 3 hours; laboratory, 3 hours", "AME485": "Design, qualification, and workmanship verification of aerospace structures. Analysis for assessing buckling and crippling, welds, and analysis of connections and thin-walled structures.", "AME491": "Analysis, design, fabrication, and evaluation of devices intended for entry in local and national design competitions. Intended for students with prior project experience. Upper division standing. Graded CR/NC.", "AME502": "Current topics in Aerospace Engineering are addressed by a number of industry panelists. Students, under panelists' supervision and guidance, complete independent research reports and briefings. Recommended preparation: AME 261, AME 441, AME 481 or equivalents. Genuine interest in design of flight vehicles. Open only to Senior, Master, and Doctoral students.", "AME504": "Use of mechanical, electrical, and computer engineering, math, and computer science to design of high performance and sophisticated products and processes and systems involving mechatronic.", "AME506": "A unified mathematical description for modeling the mechanics and thermodynamics of continua, including topics like elasticity, inelastic material modeling and fluid behavior.", "AME507": "Analysis of stress and strain; constitutive equations for elastic materials; plane stress and strain; torsion; introduction to plates and shells; energy methods.", "AME513A": "Chemical equilibrium, flame temperature, chemical kinetics, transport phenomena, conservation equations of multi-component reacting flows, laminar flames, droplet combustion, flame speed, combustion pollutants, atmospheric pollution processes.", "AME515": "Analytical techniques for heat and mass diffusion problems in various geometries; application to heat/mass transfer in solids, liquids, porous media and bioporous materials.", "AME521": "Multi-degree of freedom systems; continuous systems; modal analysis. Beams, rods, membranes, plates, shells. Approximate methods; Galerkin, Rayleigh Ritz; assumed-mode, finite elements.", "AME522": "Flows on a line and circle; phase plane methods; bifurcation theory; limit cycle/relaxation oscillations; chaotic systems, one-dimensional maps, the Lorenz equations, fractals and strange attractors.", "AME525": "Engineering mathematical methods: linear algebra, eigen problems, introduction to linear partial differential equations, transforms and complex variable theory.", "AME527": "Design synthesis of aero/hydro/mechanical systems; techniques of design; conceptual thinking; problem definition, configurational development, analytic engineering approximation, oral briefings and group problem solving. Graduate standing.", "AME528A": "Basic concepts; stiffness method; variational methods; displacement method; isoparametric formulation; plane stress and strain; plates and shells; dynamics; stability; nonlinear analysis, heat transfer; computer applications.", "AME530A": "A unified discussion of low-speed fluid mechanics including exact solutions; approximation techniques for low and high Reynolds numbers; inviscid flows; surface waves; dynamic stability; turbulence.", "AME535A": "Convergence, consistency, stability: finite difference, finite element, and spectral methods; direct and iterative procedures for steady problems; linear diffusion and advection problems; nonlinear advection problems. Recommended preparation: AME 526.", "AME541": "State space representation, linearization, solution of state equations; controllability and observability; state feedback, state observers; optimal control; output feedback.", "AME547": "Fundamentals of contemporary manufacturing automation; underlying building blocks of the automation system; mechanics-based models for designing automation system; and physical and decision-making aspects of automation.", "AME549": "Introduction to systems architecture in aerospace, electrical, computer, and manufacturing systems emphasizing the conceptual and acceptance phases and using heuristics.", "AME551": "Mechanical properties of materials; macroscopic mechanical behavior related to structure and microstructure of the material; elementary dislocation theory related to basic strengthening mechanisms; fatigue and fracture; nanomaterials.", "AME554": "Working principles of commonly used additive manufacturing processes. Process models and cost estimation methods; current applications and future directions.", "AME578": "Alternative energy/power conversion including fuel cells, photovoltaic, batteries, and biologically inspired energy processes; biomass conversion and utilization; environmental implications of alternative energy processes.", "AME588": "Materials selection in relationship to design and fabrication, economic considerations, methodology of selection, performance parameters; case studies.", "AME599": "Course content will be selected each semester to reflect current trends and developments in the field of Aerospace and Mechanical Engineering.", "ASTE101": "Gateway to the Astronautical Engineering major. Introduction to space, space exploration and the space business. Elements of orbits, spacecraft systems, rocket propulsion, and communications. Laboratory: introduction to graphics, computation and simulation.", "ASTE291": "Participation in ASTE undergraduate student team projects. Intended for lower-division students or those with little prior project experience. Departmental approval.", "ASTE331A": "Introduction to spacecraft systems: propulsion, attitude dynamics and control, structures, communications, power, thermal control. Space environment. Systems engineering as applied to spacecraft.", "ASTE470": "Introduction to rocket engineering. Space missions and thrust requirements. Compressible gas dynamics. Propellant chemistry and thermodynamics. Liquid-and-solid-fueled rockets. Nuclear and electric propulsion. Senior or graduate standing.", "ASTE505A": "Charged particle dynamics. Kinetic and fluid theories. Rarefied and collisional plasma flows. Plasma-surface interactions. Waves, instabilities, turbulence. Applications in engineering and space technology. Recommended preparation: Graduate standing in engineering or physics. (Duplicates credit in EE-572a)", "ASTE520": "System components; vehicle structure, propulsion systems, flight dynamics, thermal control, power systems, telecommunication. Interfaces and tradeoffs between these components. Testing, system reliability, and integration.", "ASTE524": "Engineering, technologies, and systems for human spaceflight. Life support, space environments, crew accommodations. Mission operations, safety. Astrodynamics, launch and space vehicles, space stations, planetary bases.", "ASTE527": "Programmatic/conceptual design synthesis/choice creation methods for complex space missions. Aerospace system engineering/architecting tools to create innovative projects. Evaluated by faculty/industry/NASA experts. Graduate standing in engineering or science. Recommended preparation: ASTE-520 or experience in space industry", "ASTE535": "Space environments and interactions with space systems. Vacuum, neutral and ionized species, plasma, radiation, micrometeoroids. Phenomena important for spacecraft operations.", "ASTE554": "Spacecraft sensors from concepts and design to building, testing, interfacing, integrating, and operations. Optical and infrared sensors, radiometers, radars, phased arrays, signal processing, noise reduction. Graduate standing in engineering or science. Recommended preparation: ASTE 520.", "ASTE557": "Spacecraft structural strength analysis and design concepts overview; spacecraft material selection; analysis of composite materials; finite element method; spacecraft configuration; structural testing; bolted joint design.", "ASTE561": "Engineering fundamentals and experimental methods of human factors design and evaluation for spacecraft which incorporate human-in-the-loop control.", "ASTE580": "Physical principles; two-body and central force motion; trajectory correction maneuvers; position and velocity in conic orbits; Lambert's problem; celestial mechanics; orbital perturbations.", "ASTE583": "Statistical orbit determination: (weighted) least squares, batch and sequential (Kalman) processing, illustrative examples; online ephemeris generation: potentially hazardous asteroids, comets, satellites; launch: vehicles, payloads, staging. Graduate standing in engineering or science. Recommended preparation: ASTE 580", "BME101": "Historical development and survey of major areas comprising biomedical engineering: theoretical neurobiology and systems physiology, biomedical instrumentation, artificial organ and prosthetic devices, biomedical computer applications.", "BME202": "Introduction to the structure and function of the nervous system for biomedical engineers. Modeling of neurophysiological processes at single neuron and systems levels.", "BME308": "Concepts of computer-aided design in 2-dimensions and 3-dimensions. Creating advanced parts using extrusions, surfaces, and equation driven sketches. Forming assemblies, and sub-assemblies, for motion analysis", "BME403": "A thorough bioengineering treatment of the physiological properties of various mammalian organ systems: e.g., cardiovascular, respiratory, renal, and musculoskeletal.", "BME404": "Mechanical properties of biological tissues and fluid transport in physiological systems: blood rheology; bi- viscoelastic solids and fluids; gas flow and mixing; prosthesis design.", "BME405": "Application of instrumentation and measurement techniques to biomedical engineering projects involving measurement, replacement or augmentation of biomedical systems.", "BME406": "Bioengineering concepts and technologies applied to cancer diagnosis, drug discovery, immunotherapeutic development, and mechanistic research.", "BME413": "Introduction to concepts relating to linear signals and systems theory, time and frequency domain analysis, and application of these concepts to problems in Biomedical Engineering.", "BME423": "Applications of parametric and nonparametric tests, analysis of variance, linear regression, time-series analysis, and autoregressive modeling, with biomedical applications to statistical analysis of biomedical data.", "BME425": "Engineering, Clinical applications and Modern Physics concepts underlying X-ray Imaging, Computed Tomography (CT), Nuclear Medicine, Positron Emission Tomography, Magnetic Resonance Imaging (MRI), Ultrasound Imaging.", "BME451": "Introduction to biomedical devices with emphasis on microtechnologies and biomedical microelectromechanical systems (bioMEMS). Principles for measurement of small-scale biological phenomena and clinical applications. Recommended preparation: basic biology and electronics", "BME452": "Engineering principles, biology, technological challenges and state-of-the-art developments in the design of implantable biomimetic microelectronic devices that interface with the nervous system. Recommended preparation: basic biology and electronics", "BME502": "Advanced topics on the structure and function of the nervous system examined from the viewpoint of computational systems science. Duplicates credit in BME 512.", "BME505A": "Integration of biomedical science, engineering principles and state-of-the-art technology for the study of selected physiological systems in the laboratory setting. Laboratory.", "BME513": "Classification; representation; statistical analysis; orthogonal expansions; least-squares estimation; harmonic analysis; Fourier, Laplace, and Z transforms; the linear system; filtering; modeling and simulation; linear control theory.", "BME527": "Medical imaging quality, compression, data standards, workflow analysis and protocols, broadband networks, image security, fault tolerance, picture archive communication system (PACS), image database and backup.", "BME559": "Drug delivery and nanoengineered materials; cutting-edge nanoparticle-based therapy; imaging and tissue engineering; Nanotoxicology and regulatory landscape.", "BME566A": "Interdisciplinary approach to impart the skills, knowledge and familiarity with stages of collaborative projects related to medical device and methods innovation in healthcare settings. Open only to Health, Technology and Engineering majors.", "BME566C": "Interdisciplinary approach to impart the skills, knowledge and familiarity with stages of collaborative projects related to medical device and methods innovation in healthcare settings.", "BME567A": "Learning from cases illustrating paths from healthcare problems to solutions. Faculty, students and invited guests will provide examples of both successful and unsuccessful innovation attempts. Open only to Health, Technology and Engineering students. Concurrent enrollment: BME 566c.", "BME620": "The theoretical basis and applied design principles for medical devices and instrumentation that interact with electrically excitable tissues of the body.", "CHE120": "Problem-solving techniques in chemical engineering, including an introduction to engineering problem analysis, mass balances, and energy balances.", "CHE305": "Introduction to numerical algorithms, computational tools, principles of probability and statistics, and their application to chemical engineering problems.", "CHE330": "Basic laws, energy and entropy balances. Multi-component phase behavior. Physical and chemical equilibria. Energy conversion and equilibrium separation processes, estimation and use of property data.", "CHE350": "Introduction to the design of chemical separation processes based on the principles of phase equilibrium, material balance and energy balance.", "CHE391": "Planning and execution of an experiment, and presentation of findings through oral presentations and a written report.Application of the scientific method learned through immersion in a lab environment. Graded C/NC.", "CHE444A": "Conduct experiments and analyze data to generate results used to solve chemical engineering problems. Communicate results, data, and solutions in written reports and oral presentations.", "CHE444B": "Conduct experiments and analyze data to generate results used to solve chemical engineering problems. Communicate results, data, and solutions in written reports and oral presentations.", "CHE447": "Differential and macroscopic equations of heat transfer; molecular and continuum approaches to diffusion and convection in fluids; simultaneous heat, mass and momentum transfer.", "CHE450": "Overview of sustainable energy, with emphasis on quantitative approaches to evaluate sustainability and examination of renewable sources of energy from the perspective of sustainability.", "CHE460": "Dynamic analysis and automation of chemical processes using closed loop control schemes. Control schemes are analyzed, simulated and implemented in the laboratory.", "CHE461": "Measurement theory and petroleum/geothermal applications of electrical, radioactive, acoustic, and production logging tools. Estimation of rock porosity, water saturation, permeability, shale content, gas flow rate.", "CHE463": "Fundamentals of flow and transport in porous materials including: Properties of porous rocks, capillarity effect, single- and multiphase flow, diffusion and dispersion in miscible displacements.", "CHE465": "Theory and practice in drilling technology; mechanical properties of reservoir rocks; well completion; acidizing and fracturing, oilproduction gechnology. Lecture, 3 hours; laboratory, 3 hours", "CHE487": "Properties and processing of nanomaterials including polymeric, metallic, and ceramic nanoparticles, composites, colloids, and surfactant self-assembly for templated nanomaterial production.", "CHE491": "Independent research in nanotechnology. Research project selected by the student in close consultation with a research advisor. Prerequisite: CHE 391L. Open only to juniors and seniors.", "CHE501": "Application of mathematics to problems in chemical engineering; mathematical modeling, differential and integral equations, linear systems analysis and stability, asymptotic and numerical methods. Recommended preparation: 445, MATH 245", "CHE510": "Management and engineering strategies utilized to improve energy efficiency. Open only to master and doctoral students. Duplicates credit in AME 577.", "CHE540": "Fluid mechanical problem of interest to chemical engineers involving laminar flows of incompressible fluids, viscous-dominated creeping flows, and motion of bubbles and drops.", "CHE550A": "Seminars to cover recent developments in the field of chemical engineering given by invited speakers. Master's students must register for 2 semesters; Ph.D. students must register for 4 semesters. Graded IP/CR/NC. Recommended preparation: graduate standing", "CHE550B": "Seminars to cover recent developments in the field of chemical engineering given by invited speakers. Master's students must register for 2 semesters; Ph.D. students must register for 4 semesters. Graded IP/CR/NC. Recommended preparation: graduate standing", "CE106": "Introduction to the civil engineering discipline, subdisciplines, technology and problem solving; technical report writing; contemporary civil engineering topics; engineering ethics.", "CE110": "Basic concepts of environmental engineering including topics of water, land, energy, air, climate, resource management, human society and professional development.", "CE205": "Statics of particles and rigid bodies; equivalent force systems; distributed forces; applications to trusses, frames, machines, beams, and cables; friction; moments of inertia.", "CE210": "Principles of environmental microbiology; waterborne pathogens; microorganisms and air pollution; microorganisms in soil; water pollution microbiology; bioremediation and biotechnology. Recommended preparation: CE 106 or CE 110.", "CE215": "Statics, kinematics and kinetics of systems of particles and rigid bodies; equivalent force systems; distributed forces and applications; moments of inertia, momentum, energy; vibrations; Eulers equations.", "CE309": "Fluid statics; relative velocity field; total acceleration; divergence theorem; conservation of mass, energy, and momentum applied to engineering problems in laminar and turbulent flow.", "CE334": "Basic material science, atomic bonding, crystalline structures, structural and mechanical behavior and characterization of metals, concrete, wood, composites and asphalt.", "CE358": "Deformations and deflections of elastic systems; statically indeterminate beams, arches, and frames; secondary stresses; computer analysis of simple structural systems.", "CE453": "Water quality criteria and fundamentals of acceptability; processes employed in treatment of water and wastewater; water reclamation and reuse; sustainability in water and wastewater systems.", "CE456": "Structural design processes for wood, steel, concrete, and masonry structural beams, columns, and connections; determination of structural loads; framing systems; and applications of structural mechanics to the design process.", "CE459": "Response of single and multiple degree of freedom systems to dynamic excitation; structural modeling and approximate solutions; introduction to earthquake resistant design.", "CE460": "Introduction to the construction processes; estimating and bidding, construction administration, planning and scheduling, equipment and methods, labor relations, cost control systems, safety and ethics.", "CE469": "Leadership in Energy and Environmental Design (LEED); green building strategies; carbon footprinting; calculating the embodied energy of building materials; cyclical processes in design and construction.", "CE476": "Design of pressurized and free surface hydraulic systems, piping networks, surge suppression, pumps, turbines, submarine outfalls, water wave interactions with marine structures, breakwater design.", "CE478": "Characteristics and properties of wood; beams, columns, trusses, connectors, and diaphragms. Properties of masonry, working stress and strength design, seismic design requirements. Prerequisite: CE 207 and CE 225.", "CE482": "Site exploration and characterization; analysis and design of structural foundations, including spread footings, mats, piles and drilled shafts; retaining wall and braced excavation design.", "CE484": "Predesign studies, precipitation softening, coagulation and flocculation, sedimentation, filtration, sludge handling, chlorination, chloramination, ozonation; plant hydraulics, flow measurement, pumps, instrumentation and control, tertiary treatment. Prerequisite: CE-451.", "CE485": "Engineering design of unit operations and unit processes for municipal wastewater treatment, including preliminary, primary, secondary, tertiary, and advanced treatments; disinfection; sludge treatment; sidestream treatment.", "CE501": "Systems, processes, and constraints governing the initiation, direction, engineering, and delivery of major construction projects. Professional construction management, responsibilities, and practice.", "CE502": "Fundamental accounting principles, financial analysis and financial control, strategic management, and a review of alternative project delivery methods.", "CE505": "The basics of databases and database management systems as applied to engineering problems. Introduction to data mining concepts, techniques, and knowledge discovery in database principles.", "CE506": "Methods engineering, work analysis and pricing for route construction. Grading, draining, paving, haul economy, plant-materials production, pipeline and bridge building.", "CE507": "Analysis of stress and strain; constitutive equations for elastic materials; plane stress and strain; torsion; introduction to plates and shells; energy methods.", "CE516": "Principles of groundwater motion; acquifer characteristics, prospecting, practical engineering problems, well design, maintenance and rehabilitation; hydrodynamic dispersion, field testing essentials and procedures, groundwater quality, artificial recharge.", "CE526": "Engineering problems discussed on a physical basis with solutions via mathematical tools: Fourier series; Fourier and Laplace transforms; partial differential equations, wave and Laplace equations. Duplicates credit in CE 525b. Recommended preparation: undergraduate multivariable calculus and ordinary differential equations.", "CE527": "Climate change; climate science fundamentals; Earth's energy balance and atmosphere; greenhouse gas dynamics; fundamentals of airborne particles; climate-aerosol interactions; particle-radiation and particle-cloud interactions.", "CE529A": "Basic concepts; stiffness method; variational methods; displacement method; isoparametric formulation; plane stress and strain; plates and shells; dynamics; stability; nonlinear analysis, heat transfer; computer applications.", "CE535": "Earthquake source mechanisms; wave propagation, scattering, diffraction and amplification; empirical scaling of strong ground motion; seismic hazard analysis for earthquake resistant design codes and mapping. Duplicates credit in former CE 535a.", "CE541A": "Forced vibrations of discrete MDOF systems; modal analysis; energy methods; analytical dynamics; vibration of continuous systems; wave propagation; computational techniques; application of commercial software tools.", "CE546": "Applications and manufacturing of composites: anisotropic materials; laminated composite plates and shells; buckling and dynamics; strength and failure; intelaminar stresses; delamination; thermal properties; design considerations.", "CE556": "Fundamental principles and practices of cost estimating, budgeting, and cost control of construction projects. Case studies and software exercises based on project data.", "CE564": "The steps and processes for the planning and pre-construction phases of a project using tools and technologies for budgeting, scheduling and planning.", "CE569": "Project controls principles including costs and schedules, cost engineering concepts, schedule development, status evaluation, progress monitoring and responses to variances and changes.", "CE570": "Multidisciplinary and geographically distributed virtual project teams used to simulate engineering and construction problems for projects selected in collaboration with industry partners. Recommended preparation:CE-556, CE-566.", "CE573": "Data-centric engineering paradigms, modeling and simulation technologies; applications for Architecture, Engineering and Construction (AEC) projects or challenges.", "CE574": "Job site logistics, field management, means and methods as they pertain to the builder, with an emphasis on constructability, productivity and schedule impacts for building construction.", "CE579": "Federal and state statutory and regulatory requirements affecting California transportation systems, including transportation planning and funding law; and government contracting, environmental and civil rights requirements.", "CE584": "Fundamentals of intelligent transportation systems, including automated vehicle technology and applications, communication systems, advanced transportation management systems, policy issues, transportation network services and smart cities.", "CE585": "Conceptual engineering geometric design, installation, and calibration of vehicular storage and traffic controls; safe flow optimization of vehicles on various thoroughfares. Recommended preparation: CE 471.", "CE634": "Analysis of policies relating to transportation alternatives; institutional environment and background; federal, state, regional, and local agency responsibilities and interactions.", "CSCI100": "A behind-the-scenes overview of the computational/algorithmic principles that form the basis of today's digital society. Exploration areas include social media, web search, videogames and location-based services.", "CSCI103": "Basic datatypes, assignments, control statements (if, switch, for, while), input/output (printf, scanf, cin, cout), functions, arrays, structures, recursion, dynamic memory, file handling. Programming in C/C++.", "CSCI104": "Introduces the student to standard data structures (linear structures such as linked lists, (balanced) trees, priority queues, and hashtables), using the C++ programming language.Prerequisite: CSCI 103. Corequisite: CSCI 170.", "CSCI170": "Sets, functions, series. Big-O notation and algorithm analysis. Propositional and first-order logic. Counting and discrete probability. Graphs and basic graph algorithms. Basic number theory.", "CSCI201": "Object-oriented paradigm for programming-in-the-large in Java; writing sophisticated concurrent applications with animation and graphic user interfaces; using professional tools on team project. Prerequisite: CSCI 104L.", "CSCI270": "Algorithm analysis. Greedy algorithms, divide and conquer, dynamic programming, graph algorithms. NP-completeness and basic recursion theory and undecidability. Sorting lower bounds. Number-theory based cryptography.", "CSCI280": "History of video games; overview of game genres; phases of video game development (concept, preproduction, production, post-production); roles of artists, programmers, designers, and producers.", "CSCI310": "Introduction to the software engineering process and software lifecycle. Covers project management, requirements, architecture, design, implementation, testing, and maintenance phase activities in team based projects. Prerequisites: CSCI 201. Duplicates credit in former CSCI 377.", "CSCI350": "Basic issues in concurrency, deadlock control, synchronization scheduling, memory management, protection and access control, inter-process communication, and structured design. Laboratory experiences with Unix-like operating system. Duplicates credit in CSCI 402.", "CSCI353": "Global Internet: design principles, layering, protocol design/analysis.Networked applications, Internet structure/architecture,Protocols for transport/congestion control, network layer/routing,link layer/MAC. Network security. Prerequisites: CSCI 201. Recommended preparation: Familiarity with C and C++.Duplicates credit in EE 450.", "CSCI356": "Computer organization; entity abstraction and representation; program execution; code optimization; memory usage; exception handling; processing control; computer performance; hands-on work done in C and assembly.", "CSCI360": "Concepts and algorithms underlying the understanding and construction of intelligent systems. Agents, problem solving, search, representation, reasoning, planning, machine learning. Prerequisites: CSCI 104 and CSCI 170. Duplicates credit in former CSCI 460.", "CSCI368": "Programming applications with dynamic graphical user interfaces. Topics include events, controls, resources, data bindings, styles and user experience.", "CSCI380": "Underlying concepts and principles required for programming video games (topics include vectors, transformations, 3-D math, geometric primitives, matrices). Prerequisite: CSCI-104 or ITP-365.", "CSCI401": "Group project with an outside stakeholder to develop real-world software solutions to large-scale problems. Topics include software engineering, professional preparation, and recent computer science research. Duplicates credit in CSCI 477a and CSCI 477b.", "CSCI402": "Concurrency, deadlock control, synchronization, process and thread scheduling, memory management, file systems, security and access control, communication and networking, distributed file systems, data management.", "CSCI420": "Computer graphics, OpenGL, 2D and 3D transformations, Bzier splines, computer animation, rendering including ray tracing, shading and lighting, artistic rendering, virtual reality, visualization.", "CSCI430": "A broad overview of security threats and defenses, security systems and functionalities, as well as current security practices. Includes homeworks and in-class exercises to provide practical experience working with such systems. Prerequisite: CSCI 201.", "CSCI435": "Applications of advanced concepts in C++ including lambda expressions, templates, secure coding, parallel programming, writing performant code, CMake and continuous integration.", "CSCI445": "Designing, building and programming mobile robots; sensors, effectors, basic control theory, control architectures, some advanced topics, illustrations of state-of-the-art. Teamwork; final project tested in a robot contest. Junior standing or higher. Prerequisites: CSCI 103.", "CSCI450": "Network architectures; layered protocols, network service interface; local, wide area, wireless networks; Internet protocols; link protocols; addressing; routing; flow control; software defined network; multimedia networks.", "CSCI452": "Introduction to parallel programming techniques, models and optimization strategies; Application mapping to multi-core, accelerator, GPU and cloud platforms; High Performance Computing and Data Science applications.", "CSCI454": "Design flow, tools, and issues related to System/Network-on-Chip (S/Noc) design for real-time embedded systems with applications in mobile, cloud, aerospace, and medical electronics. Prerequisite: EE 354.", "CSCI455": "Intensive introduction to programming principles, discrete mathematics for computing, software design and software engineering concepts. Not available for credit to computer sciencemajors, graduate or undergraduate.", "CSCI457": "Register Transfer level machine organization; performance; arithmetic; pipelined processors; exceptions, out-of-order and speculative execution, cache, virtual memory, multi-core multi-threaded processors, cache coherence.", "CSCI458": "Rounding errors in digital computation; solution of linear algebraic systems; Newton's method for nonlinear systems; matrix eigenvalues; polynomial approximation; numerical integration; numerical solution of ordinary differential equations.", "CSCI467": "Methods for building intelligent and adaptive systems from statistical analyses; theoretical understanding of such methods and the computational implications.", "CSCI476": "Introduction to modern Cryptography; Mathematical/algorithmic studies of methods for protecting information in computer and communication systems: Public-Key Cryptosystems, zero-knowledge proofs, data privacy. Prerequisites: CSCI 270.", "CSCI487": "Techniques for building the core components of a game engine; 2-D/3-D graphics, collision detection, artificial intelligence algorithms, shading, programming input devices. Prerequisite: ITP-380.", "CSCI495": "An original project will be constructed applying computer technology (in either hardware or software) to produce a result useful in the physics classroom or laboratory.", "CSCI505A": "Populations, permutations, combinations, random variables, distribution and density functions, conditional probability and expectation,; binomial, poisson, and normal distributions; laws of large numbers, central limit theorem. Prerequisite: Consent of Instructor.", "CSCI510": "Theories of management and their application to software projects. Economic analysis of software products and processes. Software cost and schedule estimation, planning and control.", "CSCI526": "Explore the complex engineering process required to design and build a real-time graphics engine to support physical realism on mobile devices. Recommended preparation: CSCI 420 or CSCI 580 or an equivalent course in graphics.", "CSCI529A": "Team projects intended to address the multifaceted technical and creative challenges that are inherent to comprehensive game development. Recommended preparation: CSCI 522 or CTIN 488.", "CSCI530": "Protecting computer networks and systems using cryptography, authentication, authorization, intrusion detection and response. Includes lab to provide practical experience working with such systems.", "CSCI536": "Linear programming models for resource allocation; simplex and revised simplex methods; duality; sensitivity; transportation problems; selected extensions to large scale, multiobjective, and special structured models.", "CSCI537": "Function and design of modern storage systems, including cloud; data management techniques; data modeling; network attached storage, clusters and data centers; relational databases; the map-reduce paradigm.", "CSCI544": "Introduction to key components of human language technologies, including: information extraction, sentiment analysis, question answering, machine translation.", "CSCI545": "Fundamental skills for modeling and controlling of dynamic systems for robotic applications and graphics animations; control theory; kinematics; dynamics; sensor processing; real-time operating systems; robot labs. Recommended preparation: Basic knowledge in linear algebra (matrices and vectors), calculus, programming in C/C++ or any another language or permission of the instructor.", "CSCI556": "Modern secret codes. Public key cryptosystems of Rivest- Shamir-Adleman, Diffie-Hellman and others. The underlying number theory and computational complexity theory.", "CSCI557": "Computer architecture from a design perspective: Pipelined processors, speculative execution, VLIW, vector processors, GPU/GPGPU, memory technology and systems, interconnection networks, shared-memory and message-passing multiprocessors, chip multiprocessors.", "CSCI560": "Graphical depictions of data for communication, analysis, and decision support. Cognitive processing and perception of visual data and visualizations. Designing effective visualizations. Implementing interactive visualizations.", "CSCI566": "Deep learning research in computer vision, natural language processing and robotics; neural networks; deep learning algorithms, tools and software.", "CSCI567": "Statistical methods for building intelligent and adaptive systems that improve performance from experiences; Focus on theoretical understanding of these methods and their computational implications. Recommended preparation: Undergraduate level training or coursework in linear algebra, multivariate calculus, basic probability and statistics; an undergraduate level course in Artificial Intelligence may be helpful but is not required.", "CSCI570": "Explores fundamental techniques such as recursion, Fourier transform ordering, dynamic programming for efficient algorithm construction. Examples include arithmetic, algebraic, graph, pattern matching, sorting, searching algorithms.", "CSCI571": "Advanced study of programming languages with application to the Web. Languages for client-side and server-side processing. Examples taken from: HTML, Java, JavaScript, Perl, XML and others. Recommended preparation: knowledge of at least two programming languages", "CSCI576": "End-to-end multimedia systems - content creation, compression, distribution using modern standards, DRM solutions, Digital-Cinema pipeline, multimedia classification, virtual-augmented reality, natural-language multimedia queries, multimodal media analysis, stereoscopic-holographic technologies.", "CSCI577A": "A: Software life-cycle processes; planning considerations for product definition, development, test, implemetation, maintenance. Team project. Graduate standing.", "CSCI578": "Study of concepts, principles and scope of software system architectures, including architectural styles, languages, connectors, middleware, dynamism, analysis, testing and domain-specific approaches.", "CSCI580": "Course outlines the process of creating images from 3D models. Includes transformations, shading, lighting, rastorization, texturing, and other topics.", "CSCI585": "Database system architecture; conceptual database models; semantic, object-oriented, logic-based, and relational databases; user and program interfaces; database system implementation; integrity, security, concurrency and recovery. Recommended preparation: Knowledge of relational databases, SQL, relational algebra and physical database design is required. Open only to graduate students.", "CSCI587": "Techniques to efficiently store, manipulate, index and query geospatial information in support of real-world geographical and decision-making applications.", "CSCI591": "Exploration and critical assessment of research activities in computer science. Course will serve as a forum for current research presentations from academia and industry. Graded CR/NC.", "CSCI593": "Fundamental techniques underlying the methodologies for system design, from integrated circuits to cyber-physical systems. Design flows, fundamental classes of models, and verification and synthesis techniques.", "CSCI646": "State-of-the-art techniques for coordinating robot teams. Distributed approaches; task allocation; control and stability; network topology; coverage and monitoring; caging; bio-inspired approaches; persistence; probabilistic methods. Recommended preparation: Solid background in linear algebra, programming and algorithm analysis skills. Open only to Computer Science doctoral students.", "CSCI651": "Computer communication protocols and systems, including classic and contemporary literature. The emphasis is on conceptual issues in the design and implementation of computer internetworks.", "CSCI653": "Advanced high-performance computer simulation techniques; multiscale deterministic and stochastic simulation algorithms on parallel and distributed computing platforms; immersive and interactive visualization of simulation data. Prerequisite: CSCI 596.", "CSCI658": "Fault models; test generation; fault simulation; self-checking and self-testing circuits; design for testability; fault tolerant design techniques; case studies.", "CSCI662": "Computational models of natural language. Formalisms for describing structures of human language, and algorithms for learning language structures from data. Recommended preparation: Proficiency in programming, algorithms and data structures, discrete math, probability theory, and calculus. Open only to doctoral students. (Duplicates credit in former CSCI 562)", "CSCI670": "Fundamental techniques for design and analysis of algorithms. Dynamic programming; network flows; theory of NP-completeness; linear programming; approximation, randomized, and online algorithms; basic cryptography. Prerequisite: CSCI 570. Recommended preparation: familiarity with algorithms and discrete mathematics. Open only to doctoral students.", "CSCI675": "Topics include: Convex sets and functions; convex optimization problems; geometric and Lagrangian duality; simplex algorithm; ellipsoid algorithm and its implications; matroid theory; submodular optimization.", "CSCI677": "Fundamental issues in computer vision: theory, algorithms and applications. Image formation, image segmentation, inference and measurement of 3-D, motion analysis, object and activity recognition.", "CSCI697": "Introduction of Ph.D. students to the broad range of computer science research. Two semesters registration required. Open to Computer Science doctoral students only. Graded CR/NC. Duplicates credit in former CSCI 597.", "CSCI698": "Practical principles for the long-term development of effective teaching in Computer Science. Intended for teaching assistants for classes offered by the Computer Science department. Graded CR/NC. Open only to Computer Science doctoral students.", "EE105": "Electrical engineering overview: communications, computers, circuits, components, signals, electromagnetics, microelectronics; data encoding and compression, USPS and UPC product codes, DVDs, semiconductor devices, and integrated circuits.", "EE109": "Information representations, embedded programming, digital and serial I/O, analog-to-digital conversion, and interrupt mechanisms. Elementary analog, logic, and state-machine design.", "EE155": "Introduction to solving engineering problems using computational methods. Survey of various programming languages and their strengths and weaknesses. Program structure, input/output, conditionals, loops, functions, arrays.", "EE202": "Lumped circuit elements; network equations; zero-input and zero-state responses; sinusoidal steady-state analysis; impedance;resonance; network functions; power concepts; transformers; Laplace transforms.", "EE250": "Introduction to hardware, operating systems, signal processing and control, network protocols, mobile applications, databases, cloud computing, machine learning, and security for the Internet of Things.", "EE301": "Representation and analysis of linear time-invariant systems primarily for the continuous time case. Convolution, Fourier series and transform, Laplace transform, controls and communications applications.", "EE330": "Basic static and dynamic electromagnetic field theory and applications; electrostatics, magnetostatics, Maxwell's equations, energy flow, plane waves incident on planar boundaries, transmission lines.", "EE338": "Semiconductor device characteristics and applications. Physical models of electronic conduction in solids, p-n junctions, bipolar and field effect transistors and other solid-state devices.", "EE354": "Digital system design and implementation; synchronous design of datapath and control; schematic/Verilog-based design, simulation, and implementation in Field Programmable Gate Arrays; timing analysis; semester-end project.", "EE364": "Introduction to concepts of randomness and uncertainty: probability, random variables, statistics. Applications to digital communications, signal processing, automatic control, computer engineering and computer science.", "EE443": "Components of power systems; analysis techniques in electrical power generation transmission and utilization; and environmental and economic considerations in system operations and planning.", "EE444": "Comprehensive assessment of the technical, environmental, and regulatory challenges that affect the future delivery and utilization of electric power. Case-study analysis.", "EE445": "Designing, building and programming mobile robots; sensors, effectors, basic control theory, control architectures, some advanced topics, illustrations of state-of-the-art. Teamwork; final project tested in a robot contest. Junior standing or higher. Prerequisites: CSCI 103.", "EE450": "Network architectures; layered protocols, network service interface; local, wide area, wireless networks; Internet protocols; link protocols; addressing; routing; flow control; software defined network; multimedia networks.", "EE451": "Introduction to parallel programming techniques, models and optimization strategies; Application mapping to multi-core, accelerator, GPU and cloud platforms; High Performance Computing and Data Science applications.", "EE454": "Design flow, tools, and issues related to System/Network-on-Chip (S/Noc) design for real-time embedded systems with applications in mobile, cloud, aerospace, and medical electronics. Prerequisite: EE 354.", "EE455": "Intensive introduction to programming principles, discrete mathematics for computing, software design and software engineering concepts. Not available for credit to computer sciencemajors, graduate or undergraduate.", "EE457": "Register Transfer level machine organization; performance; arithmetic; pipelined processors; exceptions, out-of-order and speculative execution, cache, virtual memory, multi-core multi-threaded processors, cache coherence.", "EE470": "Dynamic field theory and elementary solutions to Maxwell's equations. Introduction to propagation and radiation of electromagnetic fields. Prerequisite: 330.", "EE471": "Introductory quantum mechanics and applications. Schrodinger equation, atomic and molecular processes, time-dependent perturbation theory. Applications to lasers, solid-state demos and gaseous devices.", "EE477": "Analysis and design of digital MOS VLSI circuits including area, delay and power minimization. Laboratory assignments including design, layout, extraction, simulation and automatic synthesis.", "EE479": "MOSFET and BJT operation and models; elementary amplifier configurations; biasing and references; frequency response; feedback; operational amplifiers. Prerequisite: EE 348.", "EE482": "Analysis of linear control systems; continuous and sampled-data systems, various stability criteria; frequency response and rootlocus compensation techniques. (Duplicates credit in AME 451)", "EE483": "Fundamentals of digital signal processing covering: discrete time linear systems, quantization, sampling, Z-transforms, Fourier transforms, FFTs and filter design.", "EE500": "Computational intelligence techniques that include neural systems, deep learning, adaptive pattern classification, fuzzy function approximation, simulated annealing and evolutionary computing, and hybrid systems.", "EE503": "Rigorous coverage of probability, discrete and continuous random variables, functions of multiple random variables, covariance, correlation, random sequences, Markov chains, estimation, and introduction to statistics. Duplicates credit in former EE 464 and EE 465.", "EE504": "Laboratory oriented with lectures keyed to practical procedures and processes. Solid-state fabrication and analysis fundamentals; basic device construction techniques. Prerequisite: BSEE", "EE506": "Semiconductor bonds, crystallography, band structure assumptions, group theory, band structure results, k.p. method, quantum wells, wires and dots, superlattices, amorphous, organic semiconductors, defects, statistics, surfaces.", "EE508": "Physical basis of lithography methods for nano-scale devices. Photon-, electron-, and ion-based systems, advanced processes; resolution enhancement techniques; directed self assembly.", "EE510": "Introduction to linear algebra and matrix theory and their underlying concepts; applications to engineering problems; mathematically rigorous and foundational to other classes in communication, control, and signal processing.", "EE511": "Project-oriented investigation of simulation methods used for the analysis and design of complex stochastic systems whose operation and performance are affected by random events. Corequisite: EE 503. Recommended preparation: MatLab programming experience.", "EE512": "Probability theory and stochastic processes, including renewal theory, Markov chains, Brownian motion, martingales, and stochastic calculus. Applications in communication networks, queuing theory and financial systems.", "EE513": "Design and operation of solar photovoltaic energy converters, thermovoltoic energy converters, thermoelectric energy converters, and solid state light emitters; their roles in renewal and conservation of energy. Recommended Preparation EE 338.", "EE516": "AC/DC conversion processes, converter technologies, and design; harmonics, controls, and protection; AC/DC interactions and system performance; modeling, application, and installation; current-source versus voltage-source converters.", "EE518": "Students will build a mathematical background for studying Financial Engineering. Emphasis is on analysis, proofs and examples. Mathworks Financial toolbox will be introduced.", "EE520": "Introduces the basics of quantum computation and quantum information theory: quantum bits and registers, unitary gates, algorithms, error correction, and quantum cryptography.", "EE528": "Fundamentals of switched-mode power converters operating under steadystate and transient conditions. Feedback control systems. Magnetic circuit design.", "EE529": "Geometrical optics, electromagnetic wave propagation, reflection and refraction at interfaces, imaging with lenses and mirrors, optics of the eye, optical instruments (microscopes/telescopes/cameras), and polarization.", "EE534": "Characterization of solids by optical microscopy, electron microscopy, (TEM, SEM) and elemental and structural analysis (EPMA, ESCA, AES, SIMS, HEED, LEED, SED, etc.).", "EE536A": "a: MOSFET operation and models; elementary amplifier configurations; biasing and references; frequency response; noise; feedback; operational amplifiers; frequency compensation; non-linearity and mismatch; passive and active filters. Prerequisite: EE 448L or EE 479.", "EE537": "Integrated-circuit technologies for mixed-signal communication and data systems. Constituent device models and their limitations. Contemporary research topics.", "EE539": "Quantum mechanics for engineering majors who work with solid-state devices, quantum electronics, and photonics. Schroedinger equation, perturbation theory, electronic and optical processes.", "EE542": "Principles and technologies of server clusters, virtualized datacenters, Grids/P2P, Internet clouds, social networks, Internet of Things (IoT), and their innovative applications. Recommended preparation: EE 450 or EE 457.", "EE545": "Fundamental skills for modeling and controlling of dynamic systems for robotic applications and graphics animations; control theory; kinematics; dynamics; sensor processing; real-time operating systems; robot labs. Recommended preparation: Basic knowledge in linear algebra (matrices and vectors), calculus, programming in C/C++ or any another language or permission of the instructor.", "EE546": "Modern developments in data representation/analysis, nonconvex optimization, high-dimensional probability, sketching, clustering, low-rank models, inverse problems, applications in imaging, machine learning, computer vision and neuroscience.", "EE549": "Nanotechnology for advanced nanomaterials, nanoelectronics devices, and circuits, including the rigorous treatment of electronic band structures of carbon nanotubes, graphene, and two-dimensional materials.", "EE550": "Applications of stochastic modeling and optimization techniques to communication network design and analysis. Data link control; performance models; multi-access channels; routing and flow control.", "EE551": "Signal propagation, reflections from targets; radar equation; detection of scintillating targets; resolution; ambiguity functions; clutter rejection; tracking radars. Prerequisites: EE 364 and EE 470.", "EE555": "Broadband network architectures and services, technologies for high-speed access and core networks, optical infrastructure for layered network architectures, high performance switch and router architectures. Prerequisites: EE 450 and EE-503.", "EE556": "Stochastic system models, Dynamic programming, Linear quadratic control, Kalman filtering and estimation, System identification, approximate dynamic programming methods, adaptive control, reinforcement and online learning.", "EE557": "Computer architecture from a design perspective: Pipelined processors, speculative execution, VLIW, vector processors, GPU/GPGPU, memory technology and systems, interconnection networks, shared-memory and message-passing multiprocessors, chip multiprocessors.", "EE558": "State-of-the-art optical fiber communication system. Emphasis on optoelectronic-device and communication-systems issues necessary to provide high-speed and/or networked optical communications. Recommended preparation: EE 338; basic knowledge of optics, semiconductor, and communications concepts.", "EE562": "Random vectors, sequences, and functions. Linear transformations, second moment theory, spectral densities, narrowband processes, Gaussian processes, correlation detection, linear minimum mean square error estimation.", "EE566": "Coherent and incoherent optical transforming, imaging and two-dimensional information processing systems; optical image processing, spatial frequency response and filtering; optical and digital holography.", "EE567": "Analysis of communication systems operating from very low to optical frequencies. Comparison of modulation and detection methods. System components description. Optimum design of communication systems.", "EE577A": "Integrated circuit fabrication; circuit simulation; basic device physics; simple device layout: structured chip design; timing; project chip; MOS logic; system design; silicon compilers.", "EE577B": "VLSI design project; chip level design issues: power and clock distribution, packaging, I/O; design techniques; testability; chip fabrication and test.", "EE581": "Fundamental techniques underlying the methodologies for system design, from integrated circuits to cyber-physical systems. Design flows, fundamental classes of models, and verification and synthesis techniques.", "EE585": "Analysis of linear dynamical systems by state-space techniques; controllability, observability, stability, passivity. Application of feedback control and network synthesis.", "EE588": "Convex sets, functions, and optimization problems. Basic convex analysis and theory of convex programming. Novel, efficient first-order algorithms. Applications in the information and data sciences.", "EE593": "Sensitivity and complementary sensitivity matrices; uncertainty representation; singular values; Bode plots. Parameterization of internally stabilizing controllers. Algebraic Riccati Equations. Modern Wiener-Hopf and H-infinity designs.", "EE597": "Introduction to wireless networking technologies; fundamental architectural and design principles used at all protocol layers; optimization, performance evaluation and implementation using mathematical analysis, simulations, and experiments.", "EE598": "Introduction to research in electrical engineering. Topics vary by semester. May be repeated for up to one unit of credit for MS students, two units of credit for PhD students. Open only to Masterâ€™s and Doctoral Students.", "EE648": "Economics of networks; Game theory, Mechanism design and auctions in networks; spectrum sharing mechanisms in communications; pricing of differentiated services; network security. Prerequisites: EE-450 and EE-503.", "EE658": "Fault models; test generation; fault simulation; self-checking and self-testing circuits; design for testability; fault tolerant design techniques; case studies.", "EE660": "Supervised, semisupervised, and unsupervised machine learning; classification and regression. Model complexity, assessment, and selection; performance (error) on unseen data.", "EE669": "Lossless compression, audio/speech coding, vector quantization, fractal compression, JPEG and JPEG-2000, video compression techniques and MPEG standards, video transmission over wired and wireless networks. Recommended preparation: EE-503.", "EE676": "Fundamental issues in computer vision: theory, algorithms and applications. Image formation, image segmentation, inference and measurement of 3-D, motion analysis, object and activity recognition.", "ENE215": "Energy fundamentals; critical issues facing energy extraction, cultivation, transformation, transportation, consumption and disposal; environmental impacts.", "ENE527": "Climate change; climate science fundamentals; Earth's energy balance and atmosphere; greenhouse gas dynamics; fundamentals of airborne particles; climate-aerosol interactions; particle-radiation and particle-cloud interactions.", "ENE590": ". Research leading to the master's degree. Maximum units which may be applied to the degree to be determined by the department. Graded CR/NC.", "ENGR100A": "Recent developments in a highly technological society with emphasis on selected topics. Enrollment limited to members of the School of Engineering Honors Program. Graded CR/NC.", "ENGR100B": "Recent developments in a highly technological society with emphasis on selected topics. Enrollment limited to members of the School of Engineering Honors Program. Graded CR/NC.", "ENGR100C": "Recent developments in a highly technological society with emphasis on selected topics. Enrollment limited to members of the School of Engineering Honors Program. Graded CR/NC.", "ENGR100D": "Recent developments in a highly technological society with emphasis on selected topics. Enrollment limited to members of the School of Engineering Honors Program. Graded CR/NC.", "ENGR102": "Introduction to the profession of engineering. Ethical, political and societal consequences of engineering innovations and the impact of engineering on everyday life. Team projects and guest lectures. Open to freshmen only.", "ENGR301": "Starting and managing a technological business: developing a viable concept, market and financial planning, product development, organizing the venture, protecting intellectual property rights. (Duplicates credit in BAEP 310, BAEP 423, BAEP 450, BAEP 451)", "ENGR345": "Learner-centered, cross-cultural, technology-enabled approaches to principles and industrial practices leveraging cultural diversity to inspire innovations for competitive global markets. Requires an extended semester of 22 weeks, including 2-week overseas project in early summer.", "ENGR395A": "Supervised work experience in a professional environment related to specific degree program, academic level, and career objective. Acceptance into Cooperative Education Program required. Graded IP or CR/NC. Degree credit by departmental approval.", "ENGR395B": "Supervised work experience in a professional environment related to specific degree program, academic level, and career objective. Acceptance into Cooperative Education Program is required. Graded IP or CR/NC. Degree credit by departmental approval.", "ENGR395C": "Supervised work experience in a professional environment related to specific degree program, academic level, and career objective. Acceptance into Cooperative Program is required. Graded IP or CR/NC. Degree credit by department approval.", "ENGR395D": "Supervised work experience in a professional environment related to specific degree program, academic level, and career objective. Acceptance into Cooperative Education Program is required. Graded IP or CR/NC. Degree credit by departmental approval.", "ENGR410": "An introduction to the various ways in which social media and science are intersecting in a compelling manner; new technologies and online communities are powerful tools that are changing the ways in which scientists are engaging one another (inreach) and general audiences (outreach).", "ENGR502": "Writing of engineering curriculum- and research-related projects for Ph.D. students. Focus is on conference papers, dissertations and proposals, journal articles, and other forms. Graded CR/NC. Not available for credit to master's students.", "ENGR503": "Academic and professional presentation skills for Ph.D. students. Preparation for qualifying exams, conference paper presentations, and other forms of oral communication. Use of visual aids and poster displays included. Graded CR/NC. Not available for degree credit to master's students.", "ENGR596": "Part-time or full-time, practical work experience in the student's field of study. The internship must be located at an off-campus facility. Students are individually supervised by faculty. May not be taken until the student has completed at least one semester of enrollment in the graduate program. Graduate standing in engineering. Graded CR/NC.", "ISE105": "A combination of plant tours, laboratory experiences, and lecture are used to introduce the philosophy, subject matter, aims, goals, and techniques of industrial and systems engineering.", "ISE220": "Techniques for handling uncertainties in engineering design: discrete and continuous random variables; expectations, probability distributions and transformations of random variables; limit theorems; approximations and applications. Prerequisite: MATH 126.", "ISE315": "Techniques for planning, budgeting, scheduling, obtaining resources, monitoring and control of projects in a corporate environment. Use of software to evaluate performance and assess risks. Prerequisite: ISE 225 and ISE 330.", "ISE327": "Standardized methodology for problem solving, basic and advanced statistical tools for root cause identification and solution confirmation, key principles for quality management and organizational excellence. Prerequisite: ISE 225.", "ISE331": "Stochastic processes; Markov chains; queueing theory and queueing decision models; probabilistic inventory models. Recommended preparation: ISE 330", "ISE370": "Physiological systems and psychological characteristics; ergonomics; anthropometry; effects of the physical environment on humans; occupational safety and health; work methods.", "ISE375": "Design of facilities for operations and distribution. Product, process flow, material handling, and facility location techniques that lead to making good decisions for facilities layouts.", "ISE382": "Data models for industry applications. Modeling and designing robust databases. Implementing and querying databases with SQL. Innovations in database applications.", "ISE410": "Production planning, forecasting, scheduling, and inventory; computer integrated decision systems in analysis and control of production systems. Prerequisite: ISE 330.", "ISE422": "Business process integration is the core advantage of using ERP systems. Analyze, configure, and test business processes for a company from the ground up.", "ISE426": "Quantitative aspects of statistical quality control (process control, acceptance sampling by attribute and by variable, rectifying inspection), quality assurance and the management of QC/QA functions.", "ISE435": "Model design to simulate discrete event systems with basic input and output analysis using high order languages, applied to industrial systems analysis and design problems. Prerequisites: CSCI 101 and ISE 225.", "ISE440": "Impact of technology on work and organizational design; effects of automation; design of improvement programs; information infrastructures; teams; individual behavioral outcomes. Upper division standing.", "ISE460": "Utilizing principles of economic analysis for choice of engineering alternatives and engineering systems. Pre-tax and after-tax economy studies. Upper division standing.", "ISE487": "Methodology to store, organize, cleanse, harmonize and stage enterprise data for analytics. Report, visualize, slice and dice, forecast and predict trends.", "ISE488": "Drivers and obstacles to the process of coordinating the flow of material/information along the logistics chain. Optimize the supply network, from raw materials to sales. Not available for major credit in engineering except toward undergraduate and graduate programs offered by the Epstein Department of Industrial and Systems Engineering.", "ISE495A": "a: Preparation and development of the senior project proposal. Not available for graduate credit. Senior standing in industrial and systems engineering. Prerequisites: ISE 225 and ISE 460 and DSO 435 or ISE 382.", "ISE495B": "Group work on an industrial engineering design problem in an organization. Not available for graduate credit. Senior standing in industrial and systems engineering. Prerequisites: ISE 315 and ISE 435 and ISE 370 or ISE 470. Open only to Industrial and Systems Engineering majors.", "ISE502": "Fundamental accounting principles, financial analysis and financial control, strategic management, and a review of alternative project delivery methods.", "ISE508": "Improving operations, patient flow, quality and processes. Students will become familiar with methods for implementing change in health care settings such as hospitals or clinics.", "ISE511": "Use of mechanical, electrical, and computer engineering, math, and computer science to design of high performance and sophisticated products and processes and systems involving mechatronic.", "ISE512": "Theories of management and their application to software projects. Economic analysis of software products and processes. Software cost and schedule estimation, planning and control.", "ISE514": "Advanced concepts in production planning and scheduling including resource allocation, lot sizing, flow shop and job shop scheduling, workforce scheduling and assembly line balancing. Recommended preparation: prior knowledge of operations research and probability theory.", "ISE515": "Applying industrial and systems engineering skills to problems drawn from industry, while working in teams of 3-4 students. Teach project management skills and provide direct experience in managing and executing a group project.", "ISE527": "Principles of quality management, quality philosophies and frameworks, quality leadership and strategic planning, process management, and performance measurements.", "ISE529": "Analytics for supervised and unsupervised statistical learning. Generalized linear models, discriminant analysis, support vector machines. Nonparametric classification, trees, ensemble methods, k-nearest neighbors. Principal components, clustering.", "ISE536": "Linear programming models for resource allocation; simplex and revised simplex methods; duality; sensitivity; transportation problems; selected extensions to large scale, multiobjective, and special structured models.", "ISE538": "Random variables, stochastic processes, birth and death processes, continuous- and discrete-time Markov chains with finite and infinite number of states, renewal phenomena and queuing systems.", "ISE544": "Design and management of engineering teams. Group decision-making, motivation, leadership, infrastructure requirements, performance measurement, team diversity, conflict, and integration.", "ISE545": "Principles and practices of technology development and implementation, with application to products and systems in manufacturing and services.", "ISE556": "Stochastic system models, Dynamic programming, Linear quadratic control, Kalman filtering and estimation, System identification, approximate dynamic programming methods, adaptive control, reinforcement and online learning.", "ISE560": "Explores fundamental techniques such as recursion, Fourier transform ordering, dynamic programming for efficient algorithm construction. Examples include arithmetic, algebraic, graph, pattern matching, sorting, searching algorithms.", "ISE561": "Economic evaluations of engineering systems for both government and private industry; quantitative techniques for evaluating non-monetary consequences; formal treatment of risk and uncertainty. Prerequisite: ISE 500. Recommended preparation: An undergraduate course in engineering economy.", "ISE562": "Decision making under risk conditions; utility theory; sufficient statistics; conjugate prior distributions; terminal and pre-posterior analysis; Bayesian statistics versus classical statistics.", "ISE563": "Concepts underlying the economic analysis of engineering projects; applications to call and put options; utility theory and mathematical optimizations models; and simulation. Recommended preparation ISE 220 or an equivalent course in probability.", "ISE568": "Statistical methods for building intelligent and adaptive systems that improve performance from experiences; Focus on theoretical understanding of these methods and their computational implications. Recommended preparation: Undergraduate level training or coursework in linear algebra, multivariate calculus, basic probability and statistics; an undergraduate level course in Artificial Intelligence may be helpful but is not required.", "ISE585": "Management skills and tools for technology intensive enterprises. Life cycle analysis of technology from planning through exploitation, obsolescence and renewal.", "ISE599": "Course content will be selected each semester to reflect current trends and developments in the field of industrial and systems engineering.", "ISE610": "Advanced planning for data collection in order to investigate relationships between product/process design choices and performance; empirical modeling to predict performance; identification of the best design.", "ISE631": "Doctoral course in optimization, the foundation for subsequent courses in mathematical programming. For first-year Ph.D. students and M.S. students who intend to pursue a Ph.D. Recommended preparation: One year of calculus and one semester of linear and matrix algebra.", "ISE633": "Large scale optimization algorithms that arise in modern data science and machine learning applications. Stochastic Optimization, Accelerated Methods, Parallelization, Online Optimization, Randomized Linear Algebra", "ISE651": "Current research, guest speakers in the field; review papers; guidance in preparing research proposals and special projects. Duplicates credit in the former ISE-650abc. Open only to Fifth Year Seniors and Masterâ€™s Students.", "ISE670": "Fundamental techniques for design and analysis of algorithms. Dynamic programming; network flows; theory of NP-completeness; linear programming; approximation, randomized, and online algorithms; basic cryptography. Prerequisite: CSCI 570. Recommended preparation: familiarity with algorithms and discrete mathematics. Open only to doctoral students.", "INF250": "Fundamentals of data informatics: representation of data and knowledge, role of a data scientist, data storage/processing/analytics, machine learning, big data, and data visualization. Recommended preparation: A basic understanding of engineering and/or technology is recommended.", "INF429": "Basic concepts in information security and privacy; implications of security and privacy breaches; security and privacy policies, threats, and protection mechanisms; security and privacy laws, regulations, and ethics.", "INF519": "Threats to information systems; technical and procedural approaches to threat mitigation; policy specification and foundations of policy for secure systems; mechanisms for building secure security services; risk management. Recommended preparation: Background in computer security preferred. Recommended previous courses of study include computer science, electrical engineering, computer engineering, management information systems, and/or mathematics.", "INF523": "Assurance that an information system will behave as expected; assurance approaches for fielding secure information systems; case studies. Recommended preparation: Prior degree in computer science, electrical engineering, computer engineering, management information systems, and/or mathematics. Some background in computer security preferred.", "INF549": "Introduction to data analysis techniques and associated computing concepts for non-programmers. Topics include foundations for data analysis, visualization, parallel processing, metadata, provenance, and data stewardship. Recommended preparation: Mathematics and logic undergraduate courses.", "INF550": "Fundamentals of big data informatics techniques. Data lifecycle; the data scientist; machine learning; data mining; NoSQL databases; tools for storage/processing/analytics of large data set on clusters; in-data techniques. Recommended preparation: A basic understanding of engineering principles and programming language is desirable.", "INF551": "Function and design of modern storage systems, including cloud; data management techniques; data modeling; network attached storage, clusters and data centers; relational databases; the map-reduce paradigm.", "INF552": "Practical applications of machine learning techniques to real-world problems. Uses in data mining and recommendation systems and for building adaptive user interfaces.", "INF554": "Graphical depictions of data for communication, analysis, and decision support. Cognitive processing and perception of visual data and visualizations. Designing effective visualizations. Implementing interactive visualizations.", "INF555": "Understand and apply user interface theory and techniques to design, build and test responsive applications that run on mobile devices and/or desktops.", "INF561": "Analytics for supervised and unsupervised statistical learning. Generalized linear models, discriminant analysis, support vector machines. Nonparametric classification, trees, ensemble methods, k-nearest neighbors. Principal components, clustering.", "INF562": "Medical imaging quality, compression, data standards, workflow analysis and protocols, broadband networks, image security, fault tolerance, picture archive communication system (PACS), image database and backup.", "INF564": "Fundamental concepts in probability and statistics from a data science perspective; rigorous probabilistic reasoning and problem solving; statistical methods used in data science.", "ITP104": "Web publishing using HTML, CSS and other Web technologies. Concepts and theory of Web site creation, page layout and production. Introduction to advanced topics.", "ITP115": "Pythons high level data structures and clear syntax make it an ideal first language with powerful applications to science, business, finance, math, and the web.", "ITP125": "Introductory course in computer security. Fundamentals of information security management. Threats to information integrity. Ethical hacking concerns and practice. Policies and Procedures.", "ITP165": "Fundamentals of C++ syntax and semantics, including function prototypes, overloading, memory management, abstract data types, object creation, pointers to class members, and I/O streams.", "ITP168": "Fundamentals of MATLAB: a high-performance numeric computation and visualization environment. Overview of linear algebra and matrix manipulation; using 2-D and 3-D plotting routines; programming in MATLAB; basic numerical analysis.", "ITP190": "Digital tools for image creation, editing, composition, layout, web page development, professional page layout, and printing with color accuracy.", "ITP211": "Fundamentals of visual communication; storyboarding, still and moving image creation and modification; special effects; use of standard software tools for effective visual communication.", "ITP215": "An applied introduction to the techniques used for modeling, animating, texturing, lighting, rendering, and creating 3D content for games, cinematics, visual effects, animation, and visualizations.", "ITP249": "Introduction to data analytics. Basics of databases, applied statistics, data visualization. Leverage data to make critical business decisions.", "ITP256": "Explore blockchain technology, a secure and immutable way to record transactions. Learn the workings of cryptocurrencies and explore their impact on financial services, business and contracting.", "ITP280": "History of video games; overview of game genres; phases of video game development (concept, preproduction, production, post-production); roles of artists, programmers, designers, and producers.", "ITP301": "Concepts and technologies used to create front-end for web applications. Introduction to programming and client-side web development. User-driven website manipulation and animation.", "ITP302": "Advanced topics in Web Publishing including HTML5, CSS3, CSS Pre-processors, CSS frameworks, static site generators and content management systems, responsive web design and web accessibility.", "ITP303": "Modern web development techniques and technologies used to create web applications from ground up. Topics include front-end, back-end, and web servers.", "ITP304": "Concepts and technologies used to create database-driven websites. Database design and implementation. Server-side development to connect web applications to databases.", "ITP308": "Concepts of computer-aided design in 2-dimensions and 3-dimensions. Creating advanced parts using extrusions, surfaces, and equation driven sketches. Forming assemblies, and sub-assemblies, for motion analysis", "ITP310": "Fundamental concepts, techniques, practices, workflows, and tools associated with the practice of user experience and interaction design in web and mobile applications.", "ITP315": "Explore the performance methodologies and advanced rigging processes used to bring life to 3D characters for games, cinematics and performance animation.", "ITP320": "The role Information Systems play in an organization. Integration of Business Processes by using Enterprise Resource Planning Systems (ERP).", "ITP322": "Using geographic information systems to forward a social cause by compiling geographic data, creating and using maps, and analyzing the results; building a social impact technology product or business.", "ITP325": "Hacking from a defense perspective. Hacker ethics and laws. Penetration testing. Vulnerability assessment. Securing workstations, servers, and networks.", "ITP341": "App development for the Android open-source platform utilizing core mobile device functionalities, third-party API integration, and backend services.", "ITP342": "Introduction to the Swift programming language, various frameworks, and design patterns needed to develop applications for iOS mobile devices such as iPhones and iPads.", "ITP344": "App development for iOS devices using advanced functionalities including background data processing, network services and push notifications.", "ITP348": "Design of electronic devices that interact with the physical world; electronic interfaces; development of software algorithms; micro-controller implementation.", "ITP357": "Network technologies. Strategies for managing thousands of systems. Routers and managed switches. Integrated operating systems (IOS). Windows and Linux networking. Subnets.", "ITP368": "Programming applications with dynamic graphical user interfaces. Topics include events, controls, resources, data bindings, styles and user experience.", "ITP370": "Management techniques for security projects. Security team management. Laws and regulations for information security. Disaster recovery. Security Audits.", "ITP380": "Underlying concepts and principles required for programming video games (topics include vectors, transformations, 3-D math, geometric primitives, matrices). Prerequisite: CSCI-104 or ITP-365.", "ITP383": "Data models for industry applications. Modeling and designing robust databases. Implementing and querying databases with SQL. Innovations in database applications.", "ITP410": "An introduction to the various ways in which social media and science are intersecting in a compelling manner; new technologies and online communities are powerful tools that are changing the ways in which scientists are engaging one another (inreach) and general audiences (outreach).", "ITP411": "Visual communication and storytelling are essential skills, especially in the digital age. Overview of techniques and software to create, edit, and deliver compelling images and video.", "ITP422": "Business process integration is the core advantage of using ERP systems. Analyze, configure, and test business processes for a company from the ground up.", "ITP435": "Applications of advanced concepts in C++ including lambda expressions, templates, secure coding, parallel programming, writing performant code, CMake and continuous integration.", "ITP449": "Hands-on approach to the fundamental modeling techniques and machine learning algorithms that enable students to build robust predictive models of real-world data and test their validity.", "ITP466": "Teach students the basic technologies and processes involved in the building web and mobile startups. Students will be introduced to the different aspects of building a web startup including Online Business models, Product management, Agile development processes, Technology platforms and Operations, customer development and online marketing.", "ITP476": "Technologies, concepts and strategies in the emerging online advertising ecosystem. Strategies and tactics to drive traffic to a website and measure efficacy. Students will work with a real client and budget to craft and execute an online marketing plan.", "ITP480": "Practical experience in applying information technology skills in real-world settings. Supervised internship at companies and start-ups. Balancing academic rigor with corporate challenges and deadlines.", "ITP485": "Techniques for building the core components of a game engine; 2-D/3-D graphics, collision detection, artificial intelligence algorithms, shading, programming input devices. Prerequisite: ITP-380.", "ITP487": "Methodology to store, organize, cleanse, harmonize and stage enterprise data for analytics. Report, visualize, slice and dice, forecast and predict trends.", "ITP488": "Drivers and obstacles to the process of coordinating the flow of material/information along the logistics chain. Optimize the supply network, from raw materials to sales. Not available for major credit in engineering except toward undergraduate and graduate programs offered by the Epstein Department of Industrial and Systems Engineering.", "MASC110": "Chemical bonding and structure in crystalline, amorphous and molecular solids; tendency and mechanisms for chemical change; homogeneous and heterogeneous equilibria.", "MASC310": "Principles of mechanical behavior and processing of materials. Relationships between mechanical properties, microstructure and processing methods. Composites and nonmetallics included.", "MASC334": "Basic material science, atomic bonding, crystalline structures, structural and mechanical behavior and characterization of metals, concrete, wood, composites and asphalt.", "MASC350": "Structure, properties, synthesis, processing and design of metallic, ceramic, polymeric, electronic, photonic, composite, nanophase and biomaterials; nanostructures, microfabrication and smart materials.", "MASC471": "Introductory quantum mechanics and applications. Schrodinger equation, atomic and molecular processes, time-dependent perturbation theory. Applications to lasers, solid-state demos and gaseous devices.", "MASC503": "Classical thermodynamics, chemical potential, pure phases and mixtures; interphase relationships; binary and ternary solutions; free energy and activity; galvanic cell, electrochemical potential and Pourbaix diagram.", "MASC505": "Stereographic projection; Laue back reflection method; crystal orientation; line and planar crystalline defects; tensors; susceptibility; permeability and permittivity; stress and strain; piezoelectricity; elasticity.", "MASC506": "Semiconductor bonds, crystallography, band structure assumptions, group theory, band structure results, k.p. method, quantum wells, wires and dots, superlattices, amorphous, organic semiconductors, defects, statistics, surfaces.", "MASC508": "Physical basis of lithography methods for nano-scale devices. Photon-, electron-, and ion-based systems, advanced processes; resolution enhancement techniques; directed self assembly.", "MASC534": "Characterization of solids by optical microscopy, electron microscopy, (TEM, SEM) and elemental and structural analysis (EPMA, ESCA, AES, SIMS, HEED, LEED, SED, etc.).", "MASC535": "Transmission electron microscopy and techniques. Specimen-electron beam interaction, electron diffraction and image formation. X-ray microanalysis. Laboratory involves hands-on training on the transmission electron microscope. Recommended preparation: MASC 505.", "MASC539": "Quantum mechanics for engineering majors who work with solid-state devices, quantum electronics, and photonics. Schroedinger equation, perturbation theory, electronic and optical processes.", "MASC551": "Mechanical properties of materials; macroscopic mechanical behavior related to structure and microstructure of the material; elementary dislocation theory related to basic strengthening mechanisms; fatigue and fracture; nanomaterials.", "MASC575": "Building a parallel computer from components; molecular dynamics method; computation of structural, thermodynamics and transport properties; simulation projects.", "MASC576": "Molecular dynamics method for atomistic simulations of materials processes, simulations using parallel computing, correlation functions for structural and dynamical properties plus simulation project.", "MASC583": "Materials selection in relationship to design and fabrication, economic considerations, methodology of selection, performance parameters; case studies.", "PTE411": "Properties of porous rocks; capillarity effect, single-phase and multiphase fluid flow through porous media; diffusion and dispersion, miscible displacement heat transfer. Lecture, 3 hours. Not available for credit to Petroleum Engineering majors.", "PTE461": "Measurement theory and petroleum/geothermal applications of electrical, radioactive, acoustic, and production logging tools. Estimation of rock porosity, water saturation, permeability, shale content, gas flow rate.", "PTE463": "Fundamentals of flow and transport in porous materials including: Properties of porous rocks, capillarity effect, single- and multiphase flow, diffusion and dispersion in miscible displacements.", "PTE465": "Theory and practice in drilling technology; mechanical properties of reservoir rocks; well completion; acidizing and fracturing, oilproduction gechnology. Lecture, 3 hours; laboratory, 3 hours", "PTE500": "Introduction to mathematical and computational methods in characterizing, modeling, and describing the subsurface flow and transport phenomena. Recommended preparation: Familiarity with basic calculus, differential equation, and MATLAB programming. Open only to Engineering students.", "PTE502": "Sources of data for reservoir characterization; cross-disciplinary integration; geologic models; sequence stratigraphic, lithologic, well test and geophysical models; 4-D seismic; compartmentalized and fractured reservoirs; error and risk analysis. Graduate standing in PTE.", "PTE505": "Introduction to fundamentals of deterministic and stochastic inverse modeling, integration of dynamic data into predictive reservoir models, reservoir parameterization, derivation of adjoint models. Recommended preparation: PTE 508, Basic knowledge of calculus, linear algebra and probability/statistics.", "PTE507": "Volumetric reservoir performance; reservoirs under water influx and gas cap expansion; coning; gravity drainage; estimation of reserves and ultimate recovery. Prerequisite: 402L.", "PTE519": "Infrastructure Security, Resilience and Management of Digital Oil Fields, Process Control Networks in exploration and production, refining and chemical plants, Asset Integrity principles, case histories. Open only to graduate students.", "PTE572": "Introduction to conventional and modern geostatistical estimation and simulation techniques, combining theory with hands-on computer application of geostatistical methods in modeling the spatial phenomena.", "PTE582": "Principles of single and multiphase flow through porous media; mechanisms of immiscible and miscible displacement; momentum, heat and mass transport in porous media.", "PTE588": "Methods for oilfield data mining, data preparation mining images, prediction and knowledge discovery, subset selection, pattern recognition. Limite to students with graduate standing. Recommended preparation: prerequisites for non-majors", "PTE592": "Physical, mathematical and simulation aspects of coupled flow and geomechanics in petroleum/geothermal reservoirs. Coupled flow-geomechanics simulator development using finite element and finite volume methods.", "SAE515": "Explores broad issues and mitigation measures involved in the analysis and design of complex, uncertain, interacting infrastructure systems needing to be resilient and sustainable.", "SAE541": "Integration of engineering problem solving methodologies based on systems concepts. Application to complex, large scale technical systems and problems faced by engineering managers. Case studies.", "SAE542": "Probability theory in systems engineering: test design and performance, reliability and maintainability, quantitative decision models. Constraint theory to manage and de-conflict complex requirements. Complexity theory.", "SAE546": "Formal methods for the design and analysis of resilient systems and system-of-systems (SoS); Disruption risks as a function of system scale and complexity, management, and architectures.", "SAE547": "Approaches for modeling systems using software such as SySML; modeling system, requirements, structure, behavior, and parametrics; mapping to hardware description language and behavioral code generation. Recommended preparation: Modeling and simulation courses.", "SAE549": "Introduction to systems architecture in aerospace, electrical, computer, and manufacturing systems emphasizing the conceptual and acceptance phases and using heuristics.", "SAE550": "Analysis of risks inherent in managing high-tech/high-cost government-funded engineering programs; tools and techniques for coping with the impacts of politically-driven budgets on the engineering design process. Recommended preparation: 2 years of work experience.", "SAE560": "Impact of economic factors for systems architects and engineers, tools for understanding these factors, fundamental quantitative analysis of cash flow, life-cost estimating for systems and software engineering."}